{
  "page_name": "About Institute",
  "url": "https://www.pce.ac.in/about/the-institute/",
  "scraped_at": "2025-10-30T17:13:43.808610",
  "text_content": "Departments\nAutomobile Engineering\nProgram\nLevel\nDuration\nAutomobile Engineering\nBachelor Degree\n4 years\nComputer Engineering\nProgram\nLevel\nDuration\nComputer Engineering\nBachelor Degree\n4 years\nComputer Engineering\nMasters Degree\n2 years\nComputer Engineering\nPh.D. Program\n3 years\nElectronics & Computer Science\nProgram\nLevel\nDuration\nElectronics & Computer Science\nBachelor Degree\n4 years\nElectronics Engineering\nMasters Degree\n2 years\nElectronics Engineering\nPh.D. Program\n3 years\nElectronics & Telecommunication\nProgram\nLevel\nDuration\nEXTC Engineering\nBachelor Degree\n4 years\nInformation Technology\nProgram\nLevel\nDuration\nInformation Technology\nBachelor Degree\n4 years\nInformation Technology\nMasters Degree\n2 years\nInformation Technology\nPh.D. Program\n3 years\nMechanical Engineering\nProgram\nLevel\nDuration\nMechanical Engineering\nBachelor Degree\n4 years\nMechanical Engineering\nMasters Degree\n2 years\nMechanical Engineering\nPh.D. Program\n3 years\nApplied Science and Mathematics\nProgram\nLevel\nDuration\nASM\nBachelor Degree\n1 year\nAdmissions\nDSE Notice – Vacant seats and Merit List\nNotice 8/9/25- IL/Vacant seats and Merit List\nF.E. Documents List 2025-26\nScholarship Details\nB.Tech. DSE Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nB.Tech. F.E. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM.Tech. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM. Tech. IL & ACAP Admission\nImportant Admission Notice\nApply Online (FE only)\nOnline Portal\nPCE MOCK CET Online Portal\nPCE Online Student Portal\nPCE ASK (Attitude Skills and Knowledge) Portal\nPCE Online Library Portal\nConnect with us\nFacebook\nTwitter\nYouTube\nInstagram\nLinkedIn\nStudent Associations\nThe Institute\nMahatma Education Society’s Pillai College of Engineering, PCE, was established in 1999 (commencement of courses from A.Y. 2000-2001) as a self financed Malayalam Linguistic Minority Institute affiliated to University of Mumbai, approved by AICTE and Recognised by Govt. of Maharashtra. The college is recognized by UGC under section 12(b) and 2(f).\nPCE is one of the top Engineering colleges in India awarded A+ grade by NAAC. The University Grants Commission, New Delhi has granted Autonomous Status to PCE from the academic year 2021-22.\nMahatma Education Society, MES celebrated its 50th year in the field of education recently, is a pioneer in establishing and managing institutions in various streams of education (Schools, Colleges of Arts, Science and Commerce, Teacher Education, Architecture, Management, Engineering, and other areas) at almost all levels. Established in 1970 with the great vision ‘Education for All’, MES has a commitment to contribute in the development and progress of the Indian society.\nPillai College of Engineering was started as Pillai Institute of Information Technology, Engineering, Media Studies and Research, and popularly known as PIIT in the year 2000. The name of the institute was changed as Pillai College of Engineering in the year 2016. The brand name of MES and the proactive steps taken by the institute for providing quality education and making industry ready engineers, made PCE as a leader in engineering education under University of Mumbai.\nThe college has an enrollment of about 2700+ students in its 6 UG, 4 PG and 3 PhD Research Centers. PCE is known for interdisciplinary centers for excellence, infrastructure, value added courses, job oriented training programs, project based learning, maker spaces and the Festival of Joy- ALEGRIA.\nFour departments of PCE, Computer Engineering, Electronics Engineering, Information Technology and Mechanical Engineering were accredited by National Board of Accreditation, NBA, for 3 years from 2008. The college applied for NBA again in 2015 for its Computer, Electronics and Mechanical departments and received accreditation for 3 years. Subsequently in the year 2018, these three departments have been successfully reaccredited for next three years till 2022. The college applied for NBA again in 2022 for its Automobile, Computer, Electronics and Telecommunication, Information Technology and Mechanical Engineering departments and received accreditation for 3 years i.e. upto 30th June 2025. Four accredited programs of PCE namely Computer Engineering, Electronics Engineering, Information technology and Mechanical Engineering have been awarded Permanent Affiliation status by University of Mumbai since AY 2013-14.\nVision\nPillai College of Engineering (PCE) will admit, educate and train a diverse population of students who are academically prepared to benefit from the Institute’s infrastructure and faculty experience, to become responsible professionals or entrepreneurs in a technical arena. It will further attract, develop and retain, dedicated, excellent teachers, scholars and professionals from diverse backgrounds whose work gives them knowledge beyond the classroom and who are committed to making a significant difference in the lives of their students and the community.\nMission\nTo develop professional engineers with respect for the environment and make them responsible citizens in technological development both from an Indian and global perspective. This objective is fulfilled through quality education, practical training and interaction with industries and social organizations.\nEstablishment Year\nEstablishment Year 1999 and commencement from AY 2000-01.\nAffiliation and Approval\nAffiliated to the University of Mumbai\nApproved by All India Council for Technical Education (AICTE), New Delhi\nRecognized by Government of Maharashtra and DTE, Maharashtra.\nGranted Autonomous Status by University Grants Commission, New Delhi from the academic year 2021-22.\nAccreditation\nNAAC A+ grade\n4 UG courses are Accredited by National Board of Accreditation (NBA) in 2008\n3 UG courses are Re-accredited in 2015 by NBA\n3 UG courses are Re-accredited in 2018 by NBA\n2 UG courses Automobile, Electronics and Telecommunication accredited and 3 UG courses Computer, Information Technology and Mechanical Engineering departments re-accredited for 3 years i.e. upto 30th June, 2025\nPermanent Affiliation\n4 UG courses are Permanently Affiliated by University of Mumbai.\nUGC Recognition\nInstitute has received recognition by UGC under Section 2(f) and 12(B) from Year 2015. Granted Autonomous Status by University Grants Commission, New Delhi from the academic year 2021-22.\nPrograms offered\nThe Institute offers undergraduate (Bachelor of Technology) courses in\nPhD program in Electronics Engineering,\nAutomobile Engineering, Computer Engineering, Information Technology, Electronics & Computer Science, Electronics and Telecommunication Engineering and Mechanical Engineering, postgraduate (Master of Technology) courses in Computer Engineering, Information Technology, Electronics Engineering, Mechanical Engineering (CAD/CAM & Robotics), Mechanical Engineering (Thermal Engineering) and Ph.D. programs in Computer Engineering, Information Technology and Mechanical Engineering. It also offers numerous value added and skill courses to enhance the employability of its students.\nInfrastructure / Facilities\nPCE has\nstate-of-the-art facilities\nand its distinguished faculty have been a nurturing students of high academic capabilities. It is established on 16 acre of lush green campus with 2,30,000 sq. ft. of built up area having spacious classrooms, well-equipped laboratories and workshops, new age computer facilities and a well-stocked library provide a stimulating educational environment within the College.\nGoals\nTo develop a teaching-learning process where students will have freedom of thought and thereby explore various aspects of science, engineering and entrepreneurship.\nTo encourage the teaching Faculty to pursue research in specialized and emerging areas of technology and develop the skills to impart that knowledge to students.\nTo provide the requisite Infrastructure including Laboratories, Library, Internet facilities to facilitate research, entrepreneurship and learning.\nTo promote interaction of students and faculty with the industry.\nTo explore the possibilities of collaboration with other leading Institutes in India and abroad for faculty and / or students / training, faculty and / or students exchange and joint research.\nAbout Mahatma Education Society\nThe\nMahatma Education Society (MES)\nembarked upon its mission of “Education for All” with Chembur English High School in the year 1970.\nThe vision, dedication, global outlook, tenacious struggle and undaunted spirit of\nDr. K. M. Vasudevan Pillai\n(Founder, Chairman, and CEO) and\nDr. Daphne Pillai\n(Secretary), the Trust grew from a single school into a multi-institution, multi-location group delivering quality education at all levels.\nToday\nMES owns and manages over 48 institutions\nspread across six elegant Campuses at Borivali, Chembur, Powai, New Panvel (E) and Rasayani. It manages educational Institutions’ from pre-primary to post graduation. It comprises of Schools, International Schools, Degree Colleges, Night College, Management Institutions, Engineering Colleges, Architecture Colleges, Colleges of Education (including Physical Education) and Polytechnic Institutions. Popularly known as the\nPillai Group of Institutions,\nthis education major has its own teacher training institutes, which allow it to define its own standards and to achieve 100% results unfailingly. The group has more than 35,000 students, 2,000 teachers and 1500 members of support staff.\nMES group after establishing its name in the field of education and experience of around 30 years, ventured into in field of engineering education with establishment of\nPCE in the year 1999.\nPCE believe in encouraging the students by creating an atmosphere where learning is more fun than burden. Faculty members try to be the proverbial “Friend, philosopher and guide” for students.\nAnnouncements\nCTFC 2025 – 12th & 13th December, 2025\nInternal Assessment 2 Timetable, Oct 2025 - EXTC\nComputer Engineering Practical / Viva Exam Schedule Nov 2025\nB.Tech. Sem-I, III, V & VII (ATKT 2025-26, 2024-25, 2023-24 & 2022-23) (Theory & IA) Examination Timetable, November 202...\nM.Tech. Sem-I Regular-2025-2026 & ATKT-2024-2025 (Theory) Examination Timetable, December 2025\nB.Tech. Sem-III, V & VII (Regular-2025-2026) (Theory) Examination Timetable, November 2025\nB.Tech. Sem-III DSE (ATKT 2022-23) (Theory & IA) Examination Timetable, November 2025\nNotice for SEM I, III, V, VII (Autonomous) ATKT Examination Forms, November 2025\nInternal Assessment 1 Timetable, Sep 2025 - ECS | EXTC\nB.Tech. D.S.E. Fees Structure - English | Marathi | Malayalam\nB.Tech. F.E. Fees Structure - English | Marathi | Malayalam\nM.Tech. Fees Structure - English | Marathi | Malayalam\nNIRF Innovation Ranking 2023\nAccreditation granted for 3 years by NBA to UG Engineering Programs offered by PCE\nWe are proud to announce that Pillai College of Engineering (ARI-C-33505) has gained All India rank Band \"Performer\" (Pr...\nPillai College of Engineering adopts NISP\nSearch\nPCE\n©\nMES\n| Designed by\nVidyadhan Educational Development Private Limited\nCampuses:\nPANVEL |\nNEW PANVEL\n|\nKHANDA\n|\nRASAYANI\n|\nGORAI\n|\nCHEMBUR\nPillai Group of Institutions\nOnline\nWelcome to Pillai Group of Institutions!\nClick on Start Chat and Just say Hi!\nStart Chat\nChat with us",
  "tables": [
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Automobile Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Computer Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Computer Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Computer Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Electronics & Computer Science",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Electronics Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Electronics Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "EXTC Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Information Technology",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Information Technology",
        "Masters Degree",
        "2 years"
      ],
      [
        "Information Technology",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Mechanical Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Mechanical Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Mechanical Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "ASM",
        "Bachelor Degree",
        "1 year"
      ]
    ]
  ],
  "character_count": 11271
}