{
  "page_name": "Admissions",
  "url": "https://www.pce.ac.in/academics/admissions/",
  "scraped_at": "2025-10-30T17:12:36.412464",
  "text_content": "Departments\nAutomobile Engineering\nProgram\nLevel\nDuration\nAutomobile Engineering\nBachelor Degree\n4 years\nComputer Engineering\nProgram\nLevel\nDuration\nComputer Engineering\nBachelor Degree\n4 years\nComputer Engineering\nMasters Degree\n2 years\nComputer Engineering\nPh.D. Program\n3 years\nElectronics & Computer Science\nProgram\nLevel\nDuration\nElectronics & Computer Science\nBachelor Degree\n4 years\nElectronics Engineering\nMasters Degree\n2 years\nElectronics Engineering\nPh.D. Program\n3 years\nElectronics & Telecommunication\nProgram\nLevel\nDuration\nEXTC Engineering\nBachelor Degree\n4 years\nInformation Technology\nProgram\nLevel\nDuration\nInformation Technology\nBachelor Degree\n4 years\nInformation Technology\nMasters Degree\n2 years\nInformation Technology\nPh.D. Program\n3 years\nMechanical Engineering\nProgram\nLevel\nDuration\nMechanical Engineering\nBachelor Degree\n4 years\nMechanical Engineering\nMasters Degree\n2 years\nMechanical Engineering\nPh.D. Program\n3 years\nApplied Science and Mathematics\nProgram\nLevel\nDuration\nASM\nBachelor Degree\n1 year\nAdmissions\nDSE Notice – Vacant seats and Merit List\nNotice 8/9/25- IL/Vacant seats and Merit List\nF.E. Documents List 2025-26\nScholarship Details\nB.Tech. DSE Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nB.Tech. F.E. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM.Tech. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM. Tech. IL & ACAP Admission\nImportant Admission Notice\nApply Online (FE only)\nOnline Portal\nPCE MOCK CET Online Portal\nPCE Online Student Portal\nPCE ASK (Attitude Skills and Knowledge) Portal\nPCE Online Library Portal\nConnect with us\nFacebook\nTwitter\nYouTube\nInstagram\nLinkedIn\nStudent Associations\nAdmissions\nAPPLY ONLINE –\nadmissions.pce.ac.in\nMOCK CET\nmockcet.mes.ac.in\nMOCK CET is online platform for students to prepare for Engineering and Pharmacy entrance exams.\n100 top scoring students in MOCK CET will be rewarded with free access to Coursera Courses.\nScholarship\nScholarship Details – Registration for the Maharashtra Govt. Scholarship for Reserved Category students & EBC (view .pdf)\nB.Tech. First Year\nCourses & Intake\nAICTE approved Bachelor of Technology, Affiliated to Mumbai University (B.Tech.)\nChoice Code\nCourse Name\nYear of Establishment\nSanctioned Strength\n320724510\nComputer Engineering\n1999\n180\n320724610\nInformation Technology\n1999\n120\n320737210\nElectronics & Telecommunication Engineering\n2007\n120\n320790010\nElectronics & Computer Science\n1999\n90\n320760210\nAutomobile Engineering\n2009\n60\n320761210\nMechanical Engineering\n2002\n60\nTotal\n630\nEligibility and Requirements of B.Tech.\nPassed HSC or its equivalent examination with Physics and Mathematics as compulsory subjects along with one of the Chemistry or Biotechnology or Biology or Technical Vocational subject or Computer Science or Information Technology or Informatics Practices or Agriculture or Engineering Graphics or Business Studies, and obtained at least 45%marks (at least 40%marks, in case of Backward class categories, Economically Weaker Sectionand Persons with Disability candidates belonging to Maharashtra State only) in the above subjects taken together\nAND\nThe Candidate should have appeared in all the subjects in MHT-CET 2020 and should obtain non zero score in MHT-CET 2020 or the Candidate should obtain valid score in JEE Main (B.E/B.Tech).\nOR\nPassed Diploma in Engineering and Technology and obtained at least 45% marks (at least 40% marks, in case of Backward class categories, Economically Weaker Section and Persons with Disability candidates belonging to Maharashtra State only)\nFees Structure\nB.Tech. First Year Fees Structure 2025-26 (CAP Students) – English | Marathi / Malayalam\nB.Tech. First Year Fees Structure 2025-26 – English (view .pdf)\nB.Tech. First Year Fees Structure 2025-26 – Marathi / Malayalam (view .pdf)\nDocuments Required\nB.Tech. First Year Fees Structure 2025-26 – Marathi / Malayalam (view .pdf)\nCAP Cutoffs\nYear Wise Cutoffs Ranks for CAP Round 1 for Open Category Students\nYear\nComputer\nIT\nEXTC\nElectronics\nAutomobile\nMechanical\n2016\n15022\n21331\n23791\n39997\n23659\n11723\n2017\n14230\n18830\n26189\n50044\n23118\n10964\n2018\n10520\n16492\n32206\n57430\n26362\n14849\n2019\n14744\n22829\n60479\n82706\n32462\n32492\n2020-21\n12362\n18219\n42483\n34321\n73471\n40616\n2021-22\n13198\n17061\n38229\n49228\n54122\n66649\nApplication\nApply Online FE only\nFor more details please visit home page of\nwww.pce.ac.in\nAnnouncement\nFor more details please visit home page of\nwww.pce.ac.in\nContact\nFor Admissions Contact:\nWhatsApp Nos :\n9769710532 / 9372726276\nB.Tech. Second Year\nCourses & Intake\nAICTE approved Bachelor of Technology, Affiliated to Mumbai University (B.Tech.)\nChoice Code\nCourse Name\nYear of Establishment\nSanctioned Strength\n320724510\nComputer Engineering\n1999\n180\n320724610\nInformation Technology\n1999\n120\n320737210\nElectronics & Telecommunication Engineering\n2007\n120\n320790010\nElectronics & Computer Science\n1999\n90\n320760210\nAutomobile Engineering\n2009\n60\n320761210\nMechanical Engineering\n2002\n60\nTotal\n630\nEligibility and Requirements of B.Tech.\nPassed Diploma Course in Engineering and Technology with at least 45% marks (40% marks in case of candidates of backward class categories, Economically Weaker Section and Persons with Disability belonging to Maharashtra State only) in appropriate branch of Engineering and Technology from an All India Council for Technical Education or Central or State Government approved Institution or its equivalent;\nOR\nPassed B.Sc. Degree from a University Grants Commission (UGC) or Association of Indian Universities recognized University with at least 45% marks (40% in case of candidates of Backward class categories, Economically Weaker Section and Persons with Disability belonging to Maharashtra State only) and passed HSC with Mathematics as a subject.\nProvided that students belonging to this category shall clear the subjects of Engineering Graphics/ Engineering Drawing and Engineering Mechanics of the first year Engineering Program along with second year subjects.\nOR\nPassed D.Voc. Stream in the same or allied sector.\nIn the above cases, a suitable bridge Courses, if required such as in Mathematics may be conducted.\nAny other criterion declared from time to time by the appropriate authority as defined under the Act.\nFee Structure\nB.Tech. Direct Second Year Fees Structure 2025-26 – English | Marathi | Malayalam\nB.Tech. First Year Fees Structure 2025-26 – English (view .pdf)\nB.Tech. First Year Fees Structure 2025-26 – Marathi (view .pdf)\nB.Tech. First Year Fees Structure 2025-26 – Malayalam (view .pdf)\nDocuments Required\nDocuments Required to be Submitted for Direct Second Year Engineering Admission\nSr. No.\nDocuments\n1\nARC (CAP) Allotment Letter\n2\nFC Registration Form\n3\nNationality Certificate\n4\nS.S.C. Marksheet / Passing Certificate\n5\nFinal Year Diploma Marksheet and Passing Certificate\n6\nLeaving Certificate/Transfer Certificate\n7\nDomicile Certificate/ Birth Certificate (for Type A)\n8\nCaste Certificate for Category Students\n9\nCaste Validity for Category Students\n10\nNon-Creamy Layer Certificate( Only for Dt/VJ, NT,OBC,SBC)\n11\nProforma O for Minority Quota Studnets\n12\nMigration Certificate (If applicable)\n13\nEquivalence Certificate (If applicable)\n14\nGap Certificate (If applicable)\n15\nIncome Certificate (If Applicable)\n16\nDuly signed print out of Anti Ragging affidavit submitted online on\nwww.antiragging.in\nby candidate and parent.\n17\nPrint out of duly signed University of Mumbai Pre-admission Online Registration Form (mum.digitaluniversity.ac ) with one set of all the above mentioned documents. (University Institute Code : 561)\nNote:\nAll the Students are required to submit two sets of attested photocopies of all documents.\nAll students are requested to keep enough attested photocopies of all documents submitted to the college at the time of admission, as the original documents will be returned to the students only after completion of their course.\nAll students are required to keep a scanned copy of their documents before submitting to the college. These scanned documents are required to be uploaded for scholarships applications etc.\nCAP Cutoffs\nYear Wise Cutoffs Ranks for CAP Round 2 for Open Category Students for Direct Second Year Engineering\nYear\nComputer\nIT\nEXTC\nElectronics\nAutomobile\nMechanical\nMedian\n2016\n11266\n14350\n61010\n58704\n15175\n5398\n14763\n2017\n21075\n27281\n48958\n66850\n10766\n10318\n24178\n2018\n19028\n22190\n55786\n48232\n22973\n2525\n22582\n2019\n3661\n5307\n51820\n43557\n24331\n4301\n14819\n2020-21\n6199\n7046\n41265\n7853\n14371\n6993\n2021-22\n4084\n4210\n66756\n51779\n20838\n42744\nApplication\nFor more details please visit home page of\nwww.pce.ac.in\nAnnouncement\nFor more details please visit home page of\nwww.pce.ac.in\nContact\nFor Admissions Contact:\nWhatsApp Nos : 9769710532 / 9372726276\nM.Tech.\nCourses & Intake\nAICTE approved Master of Technology (M.Tech.), Affiliated to Mumbai University\nChoice Code\nCourse Name\nYear of Establishment\nSanctioned Strength\n320724610\nInformation Technology\n2008\n12\n320724510\nComputer Engineering\n2009\n12\n320737610\nElectronics Engineering\n2009\n12\nMechanical Engineering\nTotal\nEligibility and Requirements of M.Tech.\nPassed Bachelor Degree in the relevant field of Engineering and Technology or Pharmacy from All India Council for Technical Education or Central or State Government approved institutions or equivalent, with at least 50% marks (at least 45% marks in case of candidates of BackwardClass categories, Economically weaker sectionand Persons with Disability category belonging to Maharashtra State)\nPassed Bachelor Degree in the relevant course of Engineering and Technology or Pharmacy as specified in the eligibility criteria for admission to a Post Graduate Degree course of the concerned University for which admission is being sought;\nObtained Qualified score in Graduates Aptitude Test in Engineering (GATE) conducted by the Indian Institute of Technology and valid for the current academic year;\nOR\nObtained non-Qualified marks in Graduates Aptitude Test in Engineering (GATE) conducted by the Indian Institute of Technology for the current academic year;\nOR\nObtained Qualified score in Graduates Pharmacy Aptitude Test (GPAT) conducted by National Testing Agency and valid for the current academic year;\nOR\nObtained non-Qualified marks in Graduates Pharmacy Aptitude Test (GPAT) conducted by National Testing Agencyfor the current academic year;\nOR\nFor sponsored candidates, minimum of two years of full time work experience in a registered firm/ company/ industry/ educational and/ or research institute/ any Government Department or Government Autonomous Organization in the relevant field in which admission is being sought;\nGATE or GPAT Qualified Candidates shall have preference over the not qualified Candidates\nFees Structure\nM.Tech. First Year Fees Structure 2025-26 (CAP Students) – English | Marathi / Malayalam\nM.Tech. First Year Fees Structure 2025-26 – English (view .pdf)\nM.Tech. First Year Fees Structure 2025-26 – Marathi / Malayalam (view .pdf)\nDocuments Required\nSr. No.\nDocuments\nFor Open Category\n1\nCAP Allotment Letter\n2\nFC Acknowledgment Receipt\n3\nARC Acknowledgment Receipt\n4\nCAP Seat Acceptance Receipt\n5\nValid GATE Entrance Score Card\n6\nSSC Marksheet & Certificate\n7\nHSC / Diploma Marksheet & Certificate\n8\nB.E. All Semester Marksheets & Convocation Certificate\n9\nLeaving Certificate / Transfer Certificate\n10\nDomicile Certificate / Birth Certificate mentioning place of birth in Maharashtra\n11\nNationality Certificate / Passport\n12\nMigration (If B.E. passed from other than Mumbai University)\n13\nProforma P & Proforma Q (for Sponsored Category)\n14\n2 Sets of Xerox of above documents\n15\n2 Photos of Students\nFor Reserved Category\n16\nCaste Certificate\n17\nCaste Validity Certificate\n18\nNon-creamy Layer Certificate (Not applicable for SC / ST category student)\nApplication\nFor more details please visit home page of\nwww.pce.ac.in\nAnnouncement\nFor more details please visit home page of\nwww.pce.ac.in\nContact\nFor Admissions Contact:\nMr. Shibi Thomas\nMobile No: 9757342109 / 9769710532\nReception: 022-65748000\nAdmission Office: 022-65748009, 022-65748010\nPh.D.\nCourses & Intake\nPh.D. Programs\nYear of Establishment\nSanctioned Strength\nComputer Engineering\n2017\n10\nElectronics Engineering\n2022\n10\nMechanical Engineering\n2017\n10\nInformation Technology\n2019\n10\nEligibility and Requirements of Ph.D.\nEligibility Criteria for Admission to Ph.D. and PET:\nThe Admissions to Ph.D. program shall be through Ph.D. Entrance Test (PET) subject to fulfilling following criteria:\nThe Candidates shall have passed Master’s degree or Professional Degree or Full time Diploma declared equivalent to the Master’s degree by the corresponding Statutory / Regulatory / Apex body, of Universities which are recognized by UGC with at-least 55% marks in aggregate of all years / all semesters or its equivalent CGPA grade ‘B+’ in the UGC 10 – Points scale or an equivalent CGPA grade in a other points scale wherever grading system is followed.\nOR\nThe Candidates shall have passed Master’s Degree by Research of Universities which are recognized by UGC as equivalent there-to with at-least 55% marks in aggregate of all years / all semesters or its equivalent CGPA grade ‘B+’ in the UGC 10 – Points scale or an equivalent CGPA grade in a points scale wherever grading system is followed.\nOR\nThe Candidates who shall be the fellow members of Institute of Chartered Accountant (CA) or Associate of Company Secretary (CS) and have at-least five years of professional experience after award of such degree and also shall have at least 55% marks in aggregate of all years / all semesters or its equivalent CGPA grade ‘B+’ in the UGC 10 points scale or an equivalent CGPA grade in a points scale wherever grading system is followed.\nOR\nThe Candidate(s) who is/are working as Officers in the rank of Assistant Registrar and above rank of this University and shall have minimum Five years’ work experience as Assistant Registrar in the regular cadre with the graduate degree. However, he / she shall have to clear the aptitude test conducted by the respective Research Center as per the procedure prescribed, here-in-after.\nOR\nThe Candidate having passed the Graduate Degree course with 15 years teaching / Research experience in the related field of Research with exceptional abilities and working in National Laboratories / State Laboratories / Government Institutes / Institutes of repute those are working for the National Interest. Such candidate shall have to be nominated / sponsored by their respective employer. However the exceptional abilities will be decided by RRC committee concerned, in such cases. Further, he / she shall clear the aptitude test conducted by the respective Research center as per the procedure prescribed, here-in-after.\nA relaxation of 5% of marks, from 55% to 50%, or an equivalent relaxation of CGPA grade, may be allowed for those;\n(a) Belonging to SC/ST/VJNT/SBC/OBC category (of the Maharashtra State).\n(b) Belonging to differently-abled persons with more than 40% disability.\n(c) Who had obtained their Master’s degree prior to 19th September, 1991.\n(d) Other categories as per the decisions of the UGC, from time to time.\nHowever, the required proof to support such relaxation like Disability certificate by competent authority / Civil Surgeon, Caste Certificate, Non Creamy Layer Certificate, wherever applicable, Master’s degree certificate, etc., issued by Competent Authority is required to be produced at the time of admission / PET.\nThe candidates with professional degrees governed / regulated by AICTE / COA / BCI are also required to produce the Caste Validity Certificate at the time of admission / PET.\nThe Candidate needs to compulsorily appear in the PET of the subject in which they desire to pursue their Ph.D. degree.\nThe Candidate desirous to pursue a Ph.D. degree in a Subject / Faculty other than the degree of their post-graduation need to clear the aptitude test conducted by the relevant University Department / Research Centre before applying for PET.\nThe Candidates will also be provisionally allowed to appear for PET Entrance Test, provided :\n(a) The Candidates who have appeared for the final year / final semester examination of the Master’s Degree program of the concerned faculty and result of such candidate is awaited.\n(b) The Candidates who have applied for the revaluation after he / she was declared unsuccessful in the final year / final semester or any examination of the Master’s Degree program due to which the result of Master’s degree is kept on hold and also the revaluation result of such candidate is awaited.\nThe Entrance Test Result of such provisionally admitted Candidates will not be declared unless he / she provides the certificate, that he / she secures the required marks for being declared eligible for Entrance Test (PET).\nProcedure for Admission\nProcedure for Admission to Ph.D.\nThe admissions will be based on the criteria notified by the Research centers / Institution, keeping in view the guidelines / norms in this regard issued by the University in consonance with UGC guidelines and other statutory / Apex bodies concerned, and also taking into account the Reservation policy of the Central / State Government, from time to time.\nThe Candidates, who have been declared eligible in the Ph.D. Entrance Test (PET) and who have obtained Eligibility Certificates are eligible for admission to the Ph.D. Program, subject to fulfillment of other eligibility conditions.\nThe Candidates, who are eligible for admission in Ph.D. Program and desirous to such admission shall contact the concern Research center(s) & submit there, in writing, his willingness to join the Program at such Research center. The list of subject-wise Research center & names of the Guide will be made available on University website.\nResearch centers shall declare the program of admission on the Notice board and also on their website with at-least 15 days’ notice, clearly stating the (a) No. of Guides available, (b) Vacancies with each Guide, (c) Last date of submitting candidates application of willingness, (d) The date, time & venue of the Presentation or an interview, (e) Tentative dates of Results and (f) the Fees charged.\nThe program of admission will normally be declared within three weeks from the date of the declaration of the PET results.\nResearch centers shall scrutinize the details of applicant & eligibility of candidates as per eligibility norms prescribed by UGC / University and shall publish the list of eligible candidates and the separate list of not eligible candidates with reasons.\nThe Presentation / an interview is to be organized by the respective Research centers where-in the candidates are required to discuss their research interest / area through a presentation before the Research Advisory Committee.\nThe Presentation / Interview shall consider the following aspects, mainly, whether :\n(a) the candidate possesses the competence for the proposed research;\n(b) the research work can be suitably undertaken at the Research center;\n(c) the proposed area of research can contribute to new / additional knowledge;\nOn the basis of recommendations of Research Advisory Committee (RAC) The Research center shall declare the results of interview. RAC shall assign the guides to each candidate admitted at the respective Research center. The waiting list also shall be displayed which is valid till all admissions are completed at respective center or the date of issuance of notification for the next entrance test, whichever is earlier.\nThe candidate got selected is required to take admission by paying the prescribed fees within Two weeks. Failing of which, admission will be given to the next candidate in the waiting list.\nThe candidate shall require to produce all documents at the time of admission like UG & PG degree certificates, PET certificate, School Leaving Certificate or valid proof for Birth date, Caste certificate / Caste validity / Non Creamy layer wherever applicable and if caste benefits are claimed, marriage certificate / gazette copy in case of name change, NOC from the present employer, if required.\nResearch centers shall admit the candidates on all vacant seats subject to their sanctioned intake capacity and submit such list to the University.\nThe term of the candidate shall start from the date of their Topic Approval in the RRC Meeting.\nThe entire information / notices / circulars / program schedule is made available on website. For University Departments it will be displayed on University website and their respective Notice boards, for Colleges and Research Institutes on their respective website and Notice boards. No individual communication is sent to the candidates. They are required to visit and check the website / Notices time to time. No complaint of non receipt of information shall be entertained in such respect.\nFee Structure\nFee Structure:\nRs. 1,25,000/- per year\nDocuments Required\nSr. No.\nDocuments\n1\nS.S.C. Marksheet\n2\nH.S.C. Marksheet\n3\nB.E. / B.Tech. Degree and Marksheet\n4\nM.E. / M.Tech. Degree and Marksheet\n5\nP.E.T. Score Card\n6\nTeaching Experience Letter / Certificate\n7\nResearch Experience Letter / Certificate\n8\nDetailed Resume\n9\nResearch Statement\nApplication\nFor more details please visit home page of\nwww.pce.ac.in\nAnnouncement\nFor more details please visit home page of\nwww.pce.ac.in\nContact\nLoading…\nPCE\n©\nMES\n| Designed by\nVidyadhan Educational Development Private Limited\nCampuses:\nPANVEL |\nNEW PANVEL\n|\nKHANDA\n|\nRASAYANI\n|\nGORAI\n|\nCHEMBUR\nPillai Group of Institutions\nOnline\nWelcome to Pillai Group of Institutions!\nClick on Start Chat and Just say Hi!\nStart Chat\nChat with us",
  "tables": [
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Automobile Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Computer Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Computer Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Computer Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Electronics & Computer Science",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Electronics Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Electronics Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "EXTC Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Information Technology",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Information Technology",
        "Masters Degree",
        "2 years"
      ],
      [
        "Information Technology",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Mechanical Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Mechanical Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Mechanical Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "ASM",
        "Bachelor Degree",
        "1 year"
      ]
    ],
    [
      [
        "Choice Code",
        "Course Name",
        "Year of Establishment",
        "Sanctioned Strength"
      ],
      [
        "320724510",
        "Computer Engineering",
        "1999",
        "180"
      ],
      [
        "320724610",
        "Information Technology",
        "1999",
        "120"
      ],
      [
        "320737210",
        "Electronics & Telecommunication Engineering",
        "2007",
        "120"
      ],
      [
        "320790010",
        "Electronics & Computer Science",
        "1999",
        "90"
      ],
      [
        "320760210",
        "Automobile Engineering",
        "2009",
        "60"
      ],
      [
        "320761210",
        "Mechanical Engineering",
        "2002",
        "60"
      ],
      [
        "",
        "Total",
        "",
        "630"
      ]
    ],
    [
      [
        "Year",
        "Computer",
        "IT",
        "EXTC",
        "Electronics",
        "Automobile",
        "Mechanical"
      ],
      [
        "2016",
        "15022",
        "21331",
        "23791",
        "39997",
        "23659",
        "11723"
      ],
      [
        "2017",
        "14230",
        "18830",
        "26189",
        "50044",
        "23118",
        "10964"
      ],
      [
        "2018",
        "10520",
        "16492",
        "32206",
        "57430",
        "26362",
        "14849"
      ],
      [
        "2019",
        "14744",
        "22829",
        "60479",
        "82706",
        "32462",
        "32492"
      ],
      [
        "2020-21",
        "12362",
        "18219",
        "42483",
        "34321",
        "73471",
        "40616"
      ],
      [
        "2021-22",
        "13198",
        "17061",
        "38229",
        "49228",
        "54122",
        "66649"
      ]
    ],
    [
      [
        "Choice Code",
        "Course Name",
        "Year of Establishment",
        "Sanctioned Strength"
      ],
      [
        "320724510",
        "Computer Engineering",
        "1999",
        "180"
      ],
      [
        "320724610",
        "Information Technology",
        "1999",
        "120"
      ],
      [
        "320737210",
        "Electronics & Telecommunication Engineering",
        "2007",
        "120"
      ],
      [
        "320790010",
        "Electronics & Computer Science",
        "1999",
        "90"
      ],
      [
        "320760210",
        "Automobile Engineering",
        "2009",
        "60"
      ],
      [
        "320761210",
        "Mechanical Engineering",
        "2002",
        "60"
      ],
      [
        "",
        "Total",
        "",
        "630"
      ]
    ],
    [
      [
        "Sr. No.",
        "Documents"
      ],
      [
        "1",
        "ARC (CAP) Allotment Letter"
      ],
      [
        "2",
        "FC Registration Form"
      ],
      [
        "3",
        "Nationality Certificate"
      ],
      [
        "4",
        "S.S.C. Marksheet / Passing Certificate"
      ],
      [
        "5",
        "Final Year Diploma Marksheet and Passing Certificate"
      ],
      [
        "6",
        "Leaving Certificate/Transfer Certificate"
      ],
      [
        "7",
        "Domicile Certificate/ Birth Certificate (for Type A)"
      ],
      [
        "8",
        "Caste Certificate for Category Students"
      ],
      [
        "9",
        "Caste Validity for Category Students"
      ],
      [
        "10",
        "Non-Creamy Layer Certificate( Only for Dt/VJ, NT,OBC,SBC)"
      ],
      [
        "11",
        "Proforma O for Minority Quota Studnets"
      ],
      [
        "12",
        "Migration Certificate (If applicable)"
      ],
      [
        "13",
        "Equivalence Certificate (If applicable)"
      ],
      [
        "14",
        "Gap Certificate (If applicable)"
      ],
      [
        "15",
        "Income Certificate (If Applicable)"
      ],
      [
        "16",
        "Duly signed print out of Anti Ragging affidavit submitted online onwww.antiragging.inby candidate and parent."
      ],
      [
        "17",
        "Print out of duly signed University of Mumbai Pre-admission Online Registration Form (mum.digitaluniversity.ac ) with one set of all the above mentioned documents. (University Institute Code : 561)"
      ]
    ],
    [
      [
        "Year",
        "Computer",
        "IT",
        "EXTC",
        "Electronics",
        "Automobile",
        "Mechanical",
        "Median"
      ],
      [
        "2016",
        "11266",
        "14350",
        "61010",
        "58704",
        "15175",
        "5398",
        "14763"
      ],
      [
        "2017",
        "21075",
        "27281",
        "48958",
        "66850",
        "10766",
        "10318",
        "24178"
      ],
      [
        "2018",
        "19028",
        "22190",
        "55786",
        "48232",
        "22973",
        "2525",
        "22582"
      ],
      [
        "2019",
        "3661",
        "5307",
        "51820",
        "43557",
        "24331",
        "4301",
        "14819"
      ],
      [
        "2020-21",
        "6199",
        "7046",
        "41265",
        "7853",
        "14371",
        "6993",
        ""
      ],
      [
        "2021-22",
        "4084",
        "4210",
        "66756",
        "51779",
        "20838",
        "42744",
        ""
      ]
    ],
    [
      [
        "Choice Code",
        "Course Name",
        "Year of Establishment",
        "Sanctioned Strength"
      ],
      [
        "320724610",
        "Information Technology",
        "2008",
        "12"
      ],
      [
        "320724510",
        "Computer Engineering",
        "2009",
        "12"
      ],
      [
        "320737610",
        "Electronics Engineering",
        "2009",
        "12"
      ],
      [
        "",
        "Mechanical Engineering",
        "",
        ""
      ],
      [
        "",
        "Total",
        "",
        ""
      ]
    ],
    [
      [
        "Sr. No.",
        "Documents"
      ],
      [
        "For Open Category"
      ],
      [
        "1",
        "CAP Allotment Letter"
      ],
      [
        "2",
        "FC Acknowledgment Receipt"
      ],
      [
        "3",
        "ARC Acknowledgment Receipt"
      ],
      [
        "4",
        "CAP Seat Acceptance Receipt"
      ],
      [
        "5",
        "Valid GATE Entrance Score Card"
      ],
      [
        "6",
        "SSC Marksheet & Certificate"
      ],
      [
        "7",
        "HSC / Diploma Marksheet & Certificate"
      ],
      [
        "8",
        "B.E. All Semester Marksheets & Convocation Certificate"
      ],
      [
        "9",
        "Leaving Certificate / Transfer Certificate"
      ],
      [
        "10",
        "Domicile Certificate / Birth Certificate mentioning place of birth in Maharashtra"
      ],
      [
        "11",
        "Nationality Certificate / Passport"
      ],
      [
        "12",
        "Migration (If B.E. passed from other than Mumbai University)"
      ],
      [
        "13",
        "Proforma P & Proforma Q (for Sponsored Category)"
      ],
      [
        "14",
        "2 Sets of Xerox of above documents"
      ],
      [
        "15",
        "2 Photos of Students"
      ],
      [
        "For Reserved Category"
      ],
      [
        "16",
        "Caste Certificate"
      ],
      [
        "17",
        "Caste Validity Certificate"
      ],
      [
        "18",
        "Non-creamy Layer Certificate (Not applicable for SC / ST category student)"
      ]
    ],
    [
      [
        "Ph.D. Programs",
        "Year of Establishment",
        "Sanctioned Strength"
      ],
      [
        "Computer Engineering",
        "2017",
        "10"
      ],
      [
        "Electronics Engineering",
        "2022",
        "10"
      ],
      [
        "Mechanical Engineering",
        "2017",
        "10"
      ],
      [
        "Information Technology",
        "2019",
        "10"
      ]
    ],
    [
      [
        "Sr. No.",
        "Documents"
      ],
      [
        "1",
        "S.S.C. Marksheet"
      ],
      [
        "2",
        "H.S.C. Marksheet"
      ],
      [
        "3",
        "B.E. / B.Tech. Degree and Marksheet"
      ],
      [
        "4",
        "M.E. / M.Tech. Degree and Marksheet"
      ],
      [
        "5",
        "P.E.T. Score Card"
      ],
      [
        "6",
        "Teaching Experience Letter / Certificate"
      ],
      [
        "7",
        "Research Experience Letter / Certificate"
      ],
      [
        "8",
        "Detailed Resume"
      ],
      [
        "9",
        "Research Statement"
      ]
    ]
  ],
  "character_count": 21649
}