{
  "page_name": "Automobile Engineering",
  "url": "https://www.pce.ac.in/academics/bachelors/automobile-engineering/",
  "scraped_at": "2025-10-30T17:12:32.565937",
  "text_content": "Departments\nAutomobile Engineering\nProgram\nLevel\nDuration\nAutomobile Engineering\nBachelor Degree\n4 years\nComputer Engineering\nProgram\nLevel\nDuration\nComputer Engineering\nBachelor Degree\n4 years\nComputer Engineering\nMasters Degree\n2 years\nComputer Engineering\nPh.D. Program\n3 years\nElectronics & Computer Science\nProgram\nLevel\nDuration\nElectronics & Computer Science\nBachelor Degree\n4 years\nElectronics Engineering\nMasters Degree\n2 years\nElectronics Engineering\nPh.D. Program\n3 years\nElectronics & Telecommunication\nProgram\nLevel\nDuration\nEXTC Engineering\nBachelor Degree\n4 years\nInformation Technology\nProgram\nLevel\nDuration\nInformation Technology\nBachelor Degree\n4 years\nInformation Technology\nMasters Degree\n2 years\nInformation Technology\nPh.D. Program\n3 years\nMechanical Engineering\nProgram\nLevel\nDuration\nMechanical Engineering\nBachelor Degree\n4 years\nMechanical Engineering\nMasters Degree\n2 years\nMechanical Engineering\nPh.D. Program\n3 years\nApplied Science and Mathematics\nProgram\nLevel\nDuration\nASM\nBachelor Degree\n1 year\nAdmissions\nDSE Notice – Vacant seats and Merit List\nNotice 8/9/25- IL/Vacant seats and Merit List\nF.E. Documents List 2025-26\nScholarship Details\nB.Tech. DSE Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nB.Tech. F.E. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM.Tech. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM. Tech. IL & ACAP Admission\nImportant Admission Notice\nApply Online (FE only)\nOnline Portal\nPCE MOCK CET Online Portal\nPCE Online Student Portal\nPCE ASK (Attitude Skills and Knowledge) Portal\nPCE Online Library Portal\nConnect with us\nFacebook\nTwitter\nYouTube\nInstagram\nLinkedIn\nStudent Associations\nAutomobile Engineering\nIntroduction\nProgram Overview\nAdmission Process\nExams\nTraining and Development\nCareer Prospects\nWhy Choose Pillai College\nFAQs\nAbout Automobile Engineering\nFees Structure\nFaculty\nLab\nIntroduction\nAutomobile engineering is a specialized field of study focused on the design, manufacturing, maintenance, and innovation of automotive systems. Automobile engineering is a multidisciplinary field that combines mechanical, electrical, and electronic engineering principles to develop, improve, and maintain vehicles. It plays a crucial role in advancing transportation technology and sustainability. Its specialties include: Vehicle Design, Engine Technology, Vehicle Dynamics, Automotive Electronics, Materials and Manufacturing, Sustainability and Environmental Impact, Safety Engineering, Autonomous Vehicles, Motorsport Engineering.\nProgram Educational Objectives (PEOs):\nStudents should develop sound fundamental knowledge in mathematics, science and automobile engineering.\nStudents would acquire an ability to function productively as an individual as well as in a team and are well versed in using modern technology and equipment to solve real world problems.\nStudents would be provided with opportunities to develop an instinct for innovation and skills as researchers through industry collaboration, practical training, laboratory experience, projects and the various courses offered to them.\nStudents would inculcate a professional and ethical attitude, good leadership qualities and commitment to social responsibilities in their thought process.\nStudents will be encouraged to understand the importance of lifelong learning, working on contemporary global issues and to become a successful entrepreneur.\nProgram Specific Outcomes\nStudent should be able to generate and develop ideas that can result in self employment (eg. Start–ups) and create more jobs.\nStudents should be updated with the latest trends in automobile engineering, beyond curriculum by way of doing internships and research projects\nAutomobile Engineering\nDefinition and Scope:\nPCE’s Automobile Engineering program stands out as one of the best in Navi Mumbai, offering a comprehensive and industry-aligned curriculum designed to shape the automotive engineers of tomorrow. The course equips students with cutting-edge knowledge in vehicle design, manufacturing, and testing, blending theoretical principles with hands-on experience in state-of-the-art laboratories. With a focus on innovation, students are trained in advanced areas such as electric and hybrid vehicles, alternative fuels, and automotive safety systems, ensuring they stay ahead in this dynamic field. Pillai’s strong industry connections provide students with opportunities for internships, workshops, and live projects, offering practical exposure to real-world challenges. By fostering creativity and technical expertise, it prepares graduates to excel in leading automotive companies and make significant contributions to the future of mobility.\nVision:\nTo develop an established institution of Automobile Engineering which will become a centre of quality standardization, research and academics through innovation, high quality teaching, projects and world class technology.\nMission:\nTo provide quality education and knowledge that is well-grounded in the fundamental principles of engineering, which fosters innovation, and prepares students for leadership positions and successful careers in industry, academia or entrepreneurial ventures.\nPrograms Offered at Pillai College of Engineering\nBachelor of Automobile Engineering Course Structure:\nThe curriculum of the Automobile Engineering program focuses on core automotive concepts, vehicle dynamics, thermodynamics, and engine systems, along with emerging technologies like Electric Vehicles, Autonomous Systems, and Additive Manufacturing. Students will engage in hands-on projects and labs to develop skills in designing, analyzing, and optimizing automotive systems. The program prepares students for diverse career paths in automobile design, manufacturing, motorsports engineering, and emerging fields like electric and autonomous vehicles. This comprehensive approach equips students for roles in both traditional and cutting-edge automotive industries.\nAffiliated to\nDuration\nAcademic Year\nIntake\nTheory Exam\nCurriculum\nUniversity of Mumbai\n4 years, Full Time\n2 semesters each\n60\nUniversity of Mumbai\nSem I - VIII\nUnique Features of the Program\nPillai College of Engineering is one of the best colleges for BTech in Automobile Engineering due to the niche areas of excellence provided by the college that has been carefully curated for AE students.\nDepartment Level\nSpecialization Includes:\nGroup 1:\nElectric Vehicle, Additive Manufacturing, Motorsports Engineering\nGroup 2:\nAutonomous Vehicles, Transportation, Supply Chain Management and Logistics, Automotive Design\nApart from the specializations, the students have various\nInstitute-level\nspecializations.\nHere’s the complete list with all items and bullet points:\nEntrepreneurship Development and Management\nBusiness Management\nIntellectual Property Management\nBioengineering\nBio Instrumentation\nEngineering Design\nSustainable Technologies\nContemporary Studies\nArt and Journalism\nApplied Science\nGreen Technologies\nMaintenance Engineering\nLife Skills\nEnvironment & Safety\nResearch Areas:\nThe Faculty of the Department of Automobile Engineering are experts in numerous disciplines and are involved in following research areas:\nThermal Engineering\nAdvanced Manufacturing\nStress Analysis\nBiomaterial\nWelding Technology\nAdmission Process\nAdmission Requirements:\nStudents willing to pursue a Bachelor of Technology in Top 10 Electronic and Computer Science Engineering  Colleges in Navi Mumbai, need to meet the following qualifications:\nEligibility\n: The Candidate must have completed their 12th-grade education with Physics, Chemistry, and Mathematics as core subjects. A minimum percentage in these subjects is required, as specified by the admission authority.\nEntrance Exams\n: The candidate must have a valid score in either\nMHT-CET\n(Maharashtra Common Entrance Test) or\nJEE\n(Joint Entrance Examination). These exams determine merit-based admissions into the engineering program.\nApplication Process\n: Students can apply online through the Centralized Admission Process\n(CAP)\n, which is handled by the Directorate of Technical Education (DTE), Maharashtra. After clearing the entrance exam, candidates can select\nPillai College of Engineering\nas their preferred choice during the CAP counseling process.\nCutoff:\nElectronics & Computer Science 2024-25 at Pillai College was\n85.342\npercentile.\nDocuments Required:\nThe\ndocuments\nnecessary to complete the admission process include the following:\nSr. No.\nDocuments\n1\nARC (CAP) Allotment Letter (FC Registration Form in case of Institute Level and Against CAP Admission)\n2\nS.S.C. Marksheet and Passing Certificate\n3\nH.S.C. Marksheet and Passing Certificate\n4\nLeaving / Transfer Certificate\n5\nCaste Certificate (if applicable)\n6\nCaste Validity Certificate (if applicable)\n7\nNon-creamy Layer Certificate (only for DT/VJ, NT, OBC, SBC)\n8\nMigration Certificate (if applicable)\n9\nDomicile Certificate\n10\nEquivalence Certificate (if applicable)\n11\nPhotocopy of Aadhar Card\n12\nGap Certificate (if applicable)\n13\nIncome Certificate (if applicable)\n14\nDuly signed printout of Anti-Ragging Affidavit submitted online on www.antiragging.in by Candidate and Parent\n15\nPrintout of duly signed University of Mumbai Pre-Admission Online Registration Form (mum.digitaluniversity.ac) with one set of all the above mentioned Documents (University's Institute Code: 561)\n16\nMHT CET/JEE Score Card\nNote:\nFor the previously mentioned documents, all students have to hand in two (2) sets of attested photocopies.\nSince the original documents will only be given back to the students upon course completion, it is recommended that all students keep a suitable quantity of attested photocopies of all the documents they provided to the institution upon enrollment.\nBefore presenting their documents to the college for admission, all students must scan them. In order to submit these scanned documents for scholarships, etc., they must be uploaded.\nApplication Timeline:\nThe admission process for Automobile Engineering at Pillai College of Engineering typically follows the MHT-CET and JEE Main merit system. Here are the tentative general key application milestones:\nMHT-CET Registration\n: Generally opens in early January.\nMHT-CET Exam Date\n: Usually held in May.\nCAP Rounds\n: Commence after the exam results, typically in June-July.\nAdmission Deadlines\n: Vary based on the schedules for CAP rounds and JEE Main results.\nNote\n:\nIt is essential for prospective students to stay updated on application openings, CAP round deadlines, and document verification periods each year.\nMeeting the eligibility criteria will help ensure a smooth admission process.\nTo stay informed about specific dates, students should regularly check the official MHT-CET website.\nBy keeping track of these important dates and requirements, students can effectively navigate their journey to admission at Pillai College of Engineering.\nApply Online\nFee Structure:\nFee Structure For Maharashtra State Board Students\nYEAR\nGENERAL\nOBC\nSC/ST\nSBC/DT/VJ/NT\nTFWS\nJ&K\nFIRST YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,37,360/-\n79,534/-\n4,360/-\n21,708/-\n21,708/-\nFee Structure For Other Than Maharashtra State Board Students\nYEAR\nGENERAL\nOBC\nSC/ST\nSBC/DT/VJ/NT\nTFWS\nJ&K\nFIRST YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,38,360/-\n80,534/-\n5,360/-\n22,708/-\n22,708/-\n29,360/-\nDIRECT SECOND YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,38,360/-\n80,534/\n5,360/-\n22,708/-\n--\n--\nNote:\nThe fees for the program are subject to revision annually in accordance with institutional policies and regulatory guidelines.\nExam Preparation Resources:\nAutomobile\nEngineering Syllabus in IIT Bombay:\nTextbooks:\nFocus on NCERT textbooks for Physics, Mathematics, and Chemistry, as they cover fundamental concepts essential for both MHT-CET and JEE Main.\nReference Books:\nPhysics: “Concepts of Physics” by H.C. Verma\nMathematics: “Objective Mathematics” by R.D. Sharma\nChemistry: “Organic Chemistry” by Morrison and Boyd\nOnline Resources:\nWebsites like Khan Academy, BYJU’S, and Unacademy offer video lectures and practice problems tailored for these entrance exams.\nPrevious Year Papers:\nSolve previous years’ question papers for MHT-CET and JEE Main to understand the exam pattern and frequently asked questions.\nMock Tests:\nRegularly take mock tests to build exam temperament and time management skills for securing a seat at the best Computer Science Engineering Colleges in Maharashtra.\nNote:\nFor practicing you can visit:\nmockcet.mes.ac.in\nTraining and Development Opportunities\nInternships and Industry Collaboration:\nPillai College of Engineering (PCE) stands out as a premier institution for its exceptional placement opportunities, particularly for the Automobile Engineering course. With strong affiliations to leading companies and industries, the program ensures students gain access to promising career pathways in the dynamic automotive sector. By blending in-depth theoretical knowledge with practical skills, PCE prepares students to excel in real-world automotive challenges. The dedicated placement cell actively connects students with top-tier employers and facilitates diverse internship opportunities, making PCE, a top choice for aspiring automobile engineers.\nSome of these leading companies in collaboration with our college, who provide internships to our students are mentioned below:\nOur Industry Collaboration\nBest Automobile Engineering Training Institutes in Navi Mumbai Region:\nSkill Enhancement programs facilitated by PCE:\nIIT Bombay Remote Center:\nOur College is a Remote center for IIT Bombay with a rating of 4 stars. It helps to keep in touch with the contemporary technical skills of students and teaching skills of faculty colleagues in core Engineering and Science subjects both physically and virtually.\nValue-added courses:\nInstitute conducts various value-added courses\nto enhance the teaching and learning experience making our college one of the best automobile engineering institutes in Panvel & Navi Mumbai.\nCertification Programs:\nFinite Element Analysis\nPython and Development of Web\nApplication using Flask Framework Internet\nof Things and Its Applications\nCATIA V5 Mechanical Designer\nComplete Network Fundamentals\n:\nMastering CCNA\nMobile Application Development\nAugmented Reality\nand Virtual Reality Introduction to Remote Sensing & GIS and many more.\nGlobal Certification\nProgram on\nSolidworks at the level of Associate (CSWA\n)\nGlobal Certification Program on Solidworks at the\nlevel of Professional (CSWP)\nPCE Value Added / Certificate Programs | PCE\nStudent Clubs:\nISHRAE PCE:\nISHRAE stands for Indian Society of Heating Ventilation and Air Conditioning Engineers. It is a subchapter which comes under ISHRAE Thane Chapter controlled by ISHRAE West Zone. ISHRAE PCE Conducts Industrial Visits, Seminars, Webinars, K-12, Anubhav, Job Fair, Opportunities in Internship and Job for HVAC Department, etc\nISHRAE-PCE\nRacing Teams:\nHYPERION RACING:\nHyperion Racing is a team of dedicated students who design and manufacture racing cars in order to participate in Formula Student events around the world. The students use the knowledge acquired in the classroom to innovate while staying within the restrictions of the competitions. The team comprises students from all streams of engineering which allows the diverse thoughts and ideas. The team was started back in 2013.\nHYPERION RACING:\nSpark Racing Team is a Formula Student electric type race car team,     based in Navi Mumbai. We are a team of young students who aspire to create a mark in massive competitions like Formula Imperial and Formula Bharat!  The team independently designs, manufactures and tests Automotive vehicles which then compete at National and International level competition.\nVANGUARD RACING:\nThe Vanguard Racing Team is a part of Pillai College of Engineering located in New Panvel, Navi-Mumbai. This team is made up of undergraduate engineering students from many fields that are excited about growing, developing, and planning to increase their knowledge and soft skills. We design, build, and manufacture an All-Terrain Vehicle (ATV) that competes in a variety of competitions.\nCareer Prospects for Graduates\nJob Opportunities After Graduation\nA degree in Automobile Engineering paves the way for careers in design, manufacturing, testing, and advanced automotive technologies. Graduates from prestigious colleges in Navi Mumbai are equipped with a competitive edge, unlocking global opportunities in the ever-evolving automotive industry.\nAutomobile Design Engineer\nInnovates car designs and components.\nVehicle Dynamics Engineer\nOptimizes vehicle stability and control.\nProduction Engineer\nOversees manufacturing processes and operations.\nManufacturing Engineer\nEnhances production efficiency and workflows.\nQuality Control Engineer\nEnsures product quality and compliance.\nResearch and Development Engineer\nCreates new automotive technologies.\nElectric Vehicle Engineer\nDevelops electric and hybrid vehicles.\nMotorsports Engineer\nDesigns high-performance racing vehicles.\nAutonomous Vehicle Engineer\nAdvances self-driving vehicle technology.\nAutomotive Testing Engineer\nValidates vehicle systems and performance.\nAfter completing Bachelor of Automobile Engineering at our College in Navi Mumbai, our alumni are well trained and become industry ready in totality.\nHighest package\noffered for an Automobile Engineering graduate from Pillai College of Engineering is\n7.5 LPA\n.\nPast placements records\nof Automobile Engineering graduates at PCE:\nAyush Govind Rajput, Batch of 2023-24, got placed at\nAccenture\nwith a CTC of\n4 LPA\nLakshit Kailashchander Shrimali, Batch of 2023-24, got placed at\nCADD Centre.\nRohan Nair, Batch of 2022-23, got placed at\nPeriurja Energy\nwith a CTC of\n3.60 LPA.\nKaustubh Dilip Jagdale and Abhishek Ramesh Shelar Batch of 2022-23, got placed at\nProtiviti India\nwith a CTC of\n3 LPA.\nPansare Prajwal Devidas, Narvekar Swapnil Shashikant, Umashankar Naidu & Tanish Kaler from 2021-22 batch got placed in\nTuringmind\nwith a CTC of\n7.5 LPA\nVinit Pokharkar, Batch of 2021-22, got placed at\nINFOSYS\nwith a CTC of\n3.60 LPA.\nAverage package offered for 2023-24 batch was\n3 LPA.\nOur top recruiters include:\nOur Top Recruiters Include:\nAlumni Success Stories\nViraj Shetty\nCEO (Prevalent Automotive)\nAfter Engineering degree in Automobile domain, Viraj gained extensive experience at Ashok Leyland, Volvo Cars, and Tata. Then established a start-up Prevalent Automotive PVT LTD in EV domain. With a focus on pioneering growth and development in the electric vehicle sector, taking on the challenges of manufacturing and leadership in the automotive industry.\nShridhar Sahu\nProject Research Engineer at ARAI\nShridhar Sahu\nis an alumnus of Pillai College of Engineering with a degree in Automobile Engineering. Transitioned seamlessly into advanced automotive research at the Automotive Research Association of India (ARAI). Current work focuses on developing thermal solutions for electric vehicles, alongside designing portable EVs and IoT-based data acquisition systems for enhanced connectivity and performance monitoring.\nAtul Zanjurne\nCofounder & CTO at TÜSK\nAfter completing UG in Automobile engineering from PCE Atul completed 4 years journey at\nCalamus as\nHead of Research And Development (Engineering). With this valuable experience he started a new journey with TUSK. With a simple purpose  to create an effective range of oral care products that you love using, every day.\nAshwin Kutty\nProject Engineer at Toyo Engineering India Limited\nSuccessfully completing UG in automobile engineering with multiple certifications from PCE. Ashwin got an opportunity to complete his masters in Industrial Engineering. Now he is serving as\nProject Engineer at Toyo Engineering India Limited\nWhy Choose Pillai College of Engineering for Automobile Engineering\nBest Computer Science Navi Mumbai University:\nQuality of Education at PCE :\nPillai College of Engineering stands as a distinguished institution for automobile engineering in Navi Mumbai, offering a curriculum that seamlessly combines theoretical rigor with industry-relevant training. Emphasizing practical application and real-world projects, the program equips students with comprehensive expertise to excel in the evolving automotive sector.\nPillai College of Engineering stands out as one of the best colleges for B Tech in Automobile Engineering due to its rigorous accreditation, which ensures that our programs adhere to high educational standards and deliver a curriculum that is comprehensive. Being approved by top institutional bodies, ensures that our programs meet national benchmarks and guarantees a quality learning experience, enhancing our graduates’ employability and credibility in the professional world, thus making our college one of the top colleges in Navi Mumbai.\nAffiliation and Approval\nAffiliated to the University of Mumbai\nApproved by All India Council for Technical Education (AICTE), New Delhi.\nRecognized by the Government of Maharashtra and DTE, Maharashtra.\nGranted Autonomous Status by University Grants Commission, New Delhi from the academic year 2022-23.\n4 UG courses are Permanently Affiliated with the University of Mumbai\nAccreditation\nNAAC A+ grade\n3 UG courses were Re-accredited in 2015 and in 2018 by NBA\nState-of-the-Art Facilities\nInfrastructure and Facilities:\nPCE has state of the art facilities and its distinguished faculty has been nurturing students of high academic capabilities. It is established on 16 acres of lush green campus with 2,30,000 sq. ft. of built-up area providing\ntop Electronics and\nComputer Science Classes in Navi Mumbai.\nS\nmart classroom\nAuditorium\nSeminar Halls\nE-learning Studio\nResearch Centers\nLanguage Labs\nPillai Centre of Innovation and Entrepreneurship\nGreen Infrastructure\nE-waste Recycling\nRainwater Harvesting\nSolar power generation\nPlastic Bottle Recycling Machine\nLabs specifically designed for AE Course:\nEngineering Mechanics\nAutomobile Engineering\nProduction Process\nCAD/FEA\nMaterial Technology\nMechanical Engg. Measurements\nHydraulic Machinery\nThermal Engineering\nAutotronics\nVehicle Maintenance\nIndustrial Visits for Automobile Engineering:\nRoyal Aircon\nNEXA Service center\nSimran Motors\nTata showroom\nCrescent Cold Storage Pvt. Ltd Mahape\nTarapur Atomic Power Station\nSwegon Blue Box\nAutomotive Research Association of India, Pune\nIDEMI, Sion GTPS, Uran\nViraj Profiles Tarapur\nS.M Auto Stamping\nMahindra & Mahindra (Nashik)\nONGC, Uran\nStudcraft, Pune\nDry all India Industrial visit\nYotta NM1 Datacenter\nFrequently Asked Questions\nWhat is the eligibility criteria for enrolling in Automobile Engineering at Pillai College of Engineering?\nThe students applying for any engineering course in PCE must have a 10+2 i.e to have completed 12th education with subjects Physics, Chemistry and Mathematics as their core subjects. They must also score a valid score in the entrance exams MHT CET or JEE. Admission is based on merit through a transparent process, with specific cutoff scores varying annually.\nWhat career opportunities are available after completing an Automobile Engineering course?\nGraduates of Automobile Engineering have diverse career opportunities across various domains. They can work as design engineers, production engineers, quality control specialists, or research and development experts in automotive manufacturing companies. Roles in emerging fields like electric vehicles, autonomous vehicles, and alternative energy systems are in high demand. Additionally, opportunities exist in motorsport engineering, supply chain management, and vehicle testing. Graduates may also explore careers in academia, entrepreneurship, or pursue higher studies in specialized areas of automotive technology.\nWhat is the admission process for automobile engineering courses at Pillai College?\nThe students who wish to apply for Automobile Engineering programs must meet the eligibility criteria for admission. The application process involves submitting the online form with the required documents and paying the application fee. For further information, check the admission page on the website.\nAre there any automobile courses available for students after completing the 10th standard?\nNo,The students applying for any engineering course in PCE must have a 10+2 i.e to have completed 12th education with subjects Physics, Chemistry and Mathematics as their core subjects.\nWhat programs are available for Automobile Engineering at Pillai College of Engineering?\nPillai College of Engineering offers a 4-year full-time B.Tech in Automobile Engineering with a curriculum covering Electric Vehicles, Additive Manufacturing, Motorsports, Autonomous Vehicles, Transportation, Supply Chain Management, and Automotive Designing. Students can also choose from Institute-level specializations such as Business and Entrepreneurship, Bioengineering, Engineering Design, Art and Humanities, Applied Science, and Life Skills, Repair, Maintenance, and Safety.\nWhat are the key deadlines for the application process?\nFor detailed information about application deadlines and the admission process for the Automobile Engineering program at Pillai College of Engineering, please visit the admission page.\nWhat entrance exams are required for admission to Electrical and Computer Engineering?\nThere are two entrance exams that are accepted including the Joint Entrance Examination(JEE) or the Maharashtra Health and Technical Common Entrance Test(MHT CET). A credible score in either of these exams is accepted.\nWhat internship opportunities are available for students?\nStudents can gain practical experience through summer internships at leading tech companies, research institutions, and startups in areas like software development, hardware design, embedded systems, and IoT. The college’s dedicated Training and Placement Cell assists students in securing internships aligned with their interests and career goals.\nDoes Pillai College of Engineering offer job placement services?\nYes. Pillai College is affiliated with various reputed and recognized companies including L&T Infotech, GEP, Capgemini, Tata Consultancy Service, Ekeeda and Dyson.\nFaculty\nAutomobile Engineering Faculty\nDr. Amey P. Marathe\nameymarathe@mes.ac.in\nDr. Basavaraj S. T\nbtalikotti@mes.ac.in\nSalim Jafri\nsalimjafri@mes.ac.in\nGeorge Varghese\ngeorgevarghese@mes.ac.in\nGeeta J. Karmarkar\ngeetakarmarkar@mes.ac.in\nKomal A. Kadam\nkadam@mes.ac.in\nKomal Chilwal\nkomalchilwal@mes.ac.in\nAmeya P. Nijasure\nnapradeep@mes.ac.in\nJisha Satheesh\njishasatheesh@mes.ac.in\nFaculty\nAutomobile Engineering Faculty\nDr. Amey P. Marathe\nameymarathe@mes.ac.in\nDr. Basavaraj S. T\nbtalikotti@mes.ac.in\nGeorge Varghese\ngeorgevarghese@mes.ac.in\nSalim Jafri\nsalimjafri@mes.ac.in\nKomal A. Kadam\nkadam@mes.ac.in\nGeeta J. Karmarkar\ngeetakarmarkar@mes.ac.in\nKomal Chilwal\nkomalchilwal@mes.ac.in\nAmeya P. Nijasure\nnapradeep@mes.ac.in\nJisha Satheesh\njishasatheesh@mes.ac.in\nApply For Admission\nPCE\n©\nMES\n| Designed by\nVidyadhan Educational Development Private Limited\nCampuses:\nPANVEL |\nNEW PANVEL\n|\nKHANDA\n|\nRASAYANI\n|\nGORAI\n|\nCHEMBUR\nPillai Group of Institutions\nOnline\nWelcome to Pillai Group of Institutions!\nClick on Start Chat and Just say Hi!\nStart Chat\nChat with us\nStart Your Engineering Journey at PCE\nFill the Admission Enquiry Form\nName\n*\nPhone Number\n*\nEmail\n*\nCET Score\nField of Interest\n*\nSelect a Course\nAutomobile Engineering\nComputer Engineering\nElectronics and Computer Science\nElectronics and Telecommunication\nInformation Technology\nMechanical Engineering\nSubmit",
  "tables": [
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Automobile Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Computer Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Computer Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Computer Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Electronics & Computer Science",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Electronics Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Electronics Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "EXTC Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Information Technology",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Information Technology",
        "Masters Degree",
        "2 years"
      ],
      [
        "Information Technology",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Mechanical Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Mechanical Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Mechanical Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "ASM",
        "Bachelor Degree",
        "1 year"
      ]
    ],
    [
      [
        "Affiliated to",
        "Duration",
        "Academic Year",
        "Intake",
        "Theory Exam",
        "Curriculum"
      ],
      [
        "University of Mumbai",
        "4 years, Full Time",
        "2 semesters each",
        "60",
        "University of Mumbai",
        "Sem I - VIII"
      ]
    ],
    [
      [
        "Sr. No.",
        "Documents"
      ],
      [
        "1",
        "ARC (CAP) Allotment Letter (FC Registration Form in case of Institute Level and Against CAP Admission)"
      ],
      [
        "2",
        "S.S.C. Marksheet and Passing Certificate"
      ],
      [
        "3",
        "H.S.C. Marksheet and Passing Certificate"
      ],
      [
        "4",
        "Leaving / Transfer Certificate"
      ],
      [
        "5",
        "Caste Certificate (if applicable)"
      ],
      [
        "6",
        "Caste Validity Certificate (if applicable)"
      ],
      [
        "7",
        "Non-creamy Layer Certificate (only for DT/VJ, NT, OBC, SBC)"
      ],
      [
        "8",
        "Migration Certificate (if applicable)"
      ],
      [
        "9",
        "Domicile Certificate"
      ],
      [
        "10",
        "Equivalence Certificate (if applicable)"
      ],
      [
        "11",
        "Photocopy of Aadhar Card"
      ],
      [
        "12",
        "Gap Certificate (if applicable)"
      ],
      [
        "13",
        "Income Certificate (if applicable)"
      ],
      [
        "14",
        "Duly signed printout of Anti-Ragging Affidavit submitted online on www.antiragging.in by Candidate and Parent"
      ],
      [
        "15",
        "Printout of duly signed University of Mumbai Pre-Admission Online Registration Form (mum.digitaluniversity.ac) with one set of all the above mentioned Documents (University's Institute Code: 561)"
      ],
      [
        "16",
        "MHT CET/JEE Score Card"
      ]
    ],
    [
      [
        "YEAR",
        "GENERAL",
        "OBC",
        "SC/ST",
        "SBC/DT/VJ/NT",
        "TFWS",
        "J&K"
      ],
      [
        "FIRST YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,37,360/-",
        "79,534/-",
        "4,360/-",
        "21,708/-",
        "21,708/-",
        ""
      ]
    ],
    [
      [
        "YEAR",
        "GENERAL",
        "OBC",
        "SC/ST",
        "SBC/DT/VJ/NT",
        "TFWS",
        "J&K"
      ],
      [
        "FIRST YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,38,360/-",
        "80,534/-",
        "5,360/-",
        "22,708/-",
        "22,708/-",
        "29,360/-"
      ],
      [
        "DIRECT SECOND YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,38,360/-",
        "80,534/",
        "5,360/-",
        "22,708/-",
        "--",
        "--"
      ]
    ]
  ],
  "character_count": 27496
}