{
  "page_name": "Computer Engineering",
  "url": "https://www.pce.ac.in/academics/bachelors/computer-engineering/",
  "scraped_at": "2025-10-30T17:12:09.720691",
  "text_content": "Departments\nAutomobile Engineering\nProgram\nLevel\nDuration\nAutomobile Engineering\nBachelor Degree\n4 years\nComputer Engineering\nProgram\nLevel\nDuration\nComputer Engineering\nBachelor Degree\n4 years\nComputer Engineering\nMasters Degree\n2 years\nComputer Engineering\nPh.D. Program\n3 years\nElectronics & Computer Science\nProgram\nLevel\nDuration\nElectronics & Computer Science\nBachelor Degree\n4 years\nElectronics Engineering\nMasters Degree\n2 years\nElectronics Engineering\nPh.D. Program\n3 years\nElectronics & Telecommunication\nProgram\nLevel\nDuration\nEXTC Engineering\nBachelor Degree\n4 years\nInformation Technology\nProgram\nLevel\nDuration\nInformation Technology\nBachelor Degree\n4 years\nInformation Technology\nMasters Degree\n2 years\nInformation Technology\nPh.D. Program\n3 years\nMechanical Engineering\nProgram\nLevel\nDuration\nMechanical Engineering\nBachelor Degree\n4 years\nMechanical Engineering\nMasters Degree\n2 years\nMechanical Engineering\nPh.D. Program\n3 years\nApplied Science and Mathematics\nProgram\nLevel\nDuration\nASM\nBachelor Degree\n1 year\nAdmissions\nDSE Notice – Vacant seats and Merit List\nNotice 8/9/25- IL/Vacant seats and Merit List\nF.E. Documents List 2025-26\nScholarship Details\nB.Tech. DSE Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nB.Tech. F.E. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM.Tech. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM. Tech. IL & ACAP Admission\nImportant Admission Notice\nApply Online (FE only)\nOnline Portal\nPCE MOCK CET Online Portal\nPCE Online Student Portal\nPCE ASK (Attitude Skills and Knowledge) Portal\nPCE Online Library Portal\nConnect with us\nFacebook\nTwitter\nYouTube\nInstagram\nLinkedIn\nStudent Associations\nComputer Engineering\nIntroduction\nProgram Overview\nAdmission Process\nExams\nTraining and Development\nCareer Prospects\nWhy Choose Pillai College\nFAQs\nComputer Engineering\nFees Structure\nFaculty\nLab\nIntroduction\nOverview of Computer Engineering\nThe\nB.Tech. in Computer Engineering\nprogram is designed to empower students with the essential knowledge, technical skills, and innovative mindset needed to thrive in today’s technology-driven world. It offers a well-balanced blend of\nstrong theoretical foundations, hands-on practical experience, and industry-oriented learning\n, preparing graduates to become future-ready professionals and leaders in computing, innovation, and research.\nThe curriculum covers core areas such as\nprogramming, data structures, algorithms, computer networks, operating systems, databases, and software engineering,\nalong with emerging technologies like\nartificial intelligence, machine learning, cloud computing, blockchain technology, cybersecurity, and data analytics\n— equipping students for dynamic careers in the rapidly evolving technology landscape.\nVision\nTo be a center of excellence in Computer Engineering by fostering innovation, research, entrepreneurship and shaping responsible technology leaders who drive sustainable and ethical advancements in the digital world.\nMission\nTo provide a comprehensive and industry-aligned curriculum that equips students with cutting-edge knowledge, problem-solving skills, and technological expertise in computer engineering.\nTo promote responsible computing solutions that address societal and environmental challenges, ensuring ethical use of technology for improvement in quality of life. To establish strong partnerships with industries, research institutions, and startups in order to bridge the gap between academia and real-world.\nTo nurture creativity, critical thinking, entrepreneurial spirit among students and thus empowering them to develop technology-driven solutions with positive impact on human life.\nTo foster a culture of continuous learning, adaptability, maintaining global level of competence with an aim of preparing students to excel in diverse and dynamic technological landscapes.\nProgramme Outcomes\nEngineering Graduates will be able to:\nPO1: Engineering Knowledge:\nApply knowledge of mathematics, natural science, computing, engineering fundamentals and an engineering specialization as specified in WK1 to WK4 respectively to develop the solution of complex engineering problems.\nPO2: Problem Analysis:\nIdentify, formulate, review research literature and analyze complex engineering problems reaching substantiated conclusions with consideration for sustainable development. (WK1 to WK4)\nPO3: Design/Development of Solutions:\nDesign creative solutions for complex engineering problems and design / develop systems / components / processes to meet identified needs with consideration for the public health and safety, whole-life cost, net zero carbon, culture, society and environment as required. (WK5)\nPO4: Conduct Investigations of Complex Problems:\nConduct investigations of complex engineering problems using research-based knowledge including design of experiments, modelling, analysis & interpretation of data to provide valid conclusions. (WK8).\nPO5: Engineering Tool Usage:\nCreate, select and apply appropriate techniques, resources and modern engineering & IT tools, including prediction and modelling recognizing their limitations to solve complex engineering problems. (WK2 and WK6)\nPO6: The Engineer and The World:\nAnalyze and evaluate societal and environmental aspects while solving complex engineering problems for its impact on sustainability with reference to economy, health, safety, legal framework, culture and environment. (WK1, WK5, and WK7).\nPO7: Ethics:\nApply ethical principles and commit to professional ethics, human values, diversity and inclusion; adhere to national & international laws. (WK9)\nPO8: Individual and Collaborative Team work:\nFunction effectively as an individual, and as a member or leader in diverse/multi-disciplinary teams.\nPO9: Communication:\nCommunicate effectively and inclusively within the engineering community and society at large, such as being able to comprehend and write effective reports and design documentation, make effective presentations considering cultural, language, and learning differences.\nPO10: Project Management and Finance:\nApply knowledge and understanding of engineering management principles and economic decision-making and apply these to one’s own work, as a member and leader in a team, and to manage projects and in multidisciplinary environments\nPO11: Life-Long Learning:\nRecognize the need for, and have the preparation and ability for\ni) independent and life-long learning ii) adaptability to new and emerging technologies and iii) critical thinking in the broadest context of technological change. (WK8)\nProgram Educational Objectives (PEOs)\nGraduates will demonstrate technical proficiency in computer engineering by applying industry-relevant skills, modern tools, and problem-solving abilities to design and develop innovative computing solutions in various domains.\nGraduates will engage in responsible computing practices, upholding ethical standards while developing sustainable solutions that address social, economic, and environmental challenges for the betterment of society.\nGraduates will actively contribute to research, innovation, and entrepreneurial ventures by leveraging creative thinking and collaboration with academia, industry, and startups to solve real-world problems.\nGraduates will pursue continuous learning, adapt to evolving technologies, and exhibit leadership and teamwork skills to succeed in diverse global environments and multidisciplinary teams.\nProgram Specific Outcomes (PSOs)\nGraduates will be able to apply their knowledge of computer science and engineering to solve complex problems.\nGraduates will be able to use professional engineering practices, logic, and strategies for creating innovative career paths, becoming an entrepreneur, or pursuing higher studies.\nGraduates will be able to formulate and solve real-life engineering problems concerning public health and safety with social and environmental awareness and ethical responsibility.\nComputer Engineering\nProgram Offered at Pillai College of Engineering\nBachelor of Computer Engineering Course Structure\nThe curriculum encompasses fundamental concepts in both hardware and software, such as microprocessors, data structures, computer architecture, database management, cybersecurity, data mining, artificial management, machine learning, ethical hacking, and computer architecture. Students at one of the best computer engineering colleges in Navi Mumbai gain the ability to build, implement, and optimize hardware and software systems through practical projects and labs, preparing them for careers in systems design, data science, software development, and cybersecurity.\nHere’s your information presented in a clean table format:\nAffiliated to\nDuration\nAcademic Year\nIntake\nTheory Exam\nCurriculum\nUniversity of Mumbai\n4 years, Full Time\n2 semesters each\n180\nUniversity of Mumbai\nLink\nUnique Features of the Program\nPillai College of Engineering is regarded as one of the best institutes for B.Tech in Computer Engineering in Navi Mumbai.\nThe program offers specialized tracks in:\nDepartment Level specialization Tracks\nArtificial Intelligence and Data Science\nHuman Computer Interaction\nRobotics and Automation\nCloud and Cyber Security\nInstitute Level specialization Tracks\nEntrepreneurship Development and Management\nBusiness Management\nIP Management\nBioengineering\nBio Instrumentation\nEngineering Design\nSustainable Technologies\nContemporary Studies\nArt and Journalism\nApplied Science\nGreen Technologies\nMaintenance Engineering\nLife Skills\nEnvironment & Safety\nResearch Facilities:\nResearch Lab :\nHigh Performance computing lab\nResearch Area in the Departement\nArtificial Intelligence and Data Science\nCyber Security\nDigital Forensics\nNatural Language Processing\nSocial Media Analytics\nInternet of Things\nRobotics\nUser Experience Engineering and Design\nLabs specifically designed for Computer Engineering department:\nName of Laboratory:\nComputer Architecture Lab\nNetwork Lab\nOpen Source Lab\nAdvanced Database Lab\nWeb Engineering Lab\nDatabase and Data Mining Lab\nSystem Software Lab\nComputer Programming and Data Structure Lab\nBig Data Lab\nAI-ML Lab\nAdmission Process\nAdmission Requirements:\nStudents wishing to pursue a Bachelor of Technology in Computer Engineering at one of the top colleges in Navi Mumbai must meet the following qualifications:\nEligibility\n:\nThe candidate must have completed their 12th-grade education with Physics, Chemistry, and Mathematics as core subjects. A minimum percentage in these subjects is required, as specified by the admission authority.\nEntrance Exams\n: The candidate must have a valid score in either MHT-CET (Maharashtra Common Entrance Test) or JEE (Joint Entrance Examination). These exams determine merit-based admissions into the engineering program.\nApplication Process\n: Students can apply online through the Centralized Admission Process (CAP), managed by the Directorate of Technical Education (DTE), Maharashtra. After clearing the entrance exam, candidates can select Pillai College of Engineering as their preferred choice during the CAP counseling process.\nCutoff:\nThe cutoff for Computer Engineering for the 2024-25 academic year at Pillai College was 95.89 percentile.\nDocuments Required:\nThe\ndocuments\nnecessary to complete the admission process include the following:\nSr. No.\nDocuments\n1\nARC (CAP) Allotment Letter (FC Registration Form in case of Institute Level and Against CAP Admission)\n2\nS.S.C. Marksheet and Passing Certificate\n3\nH.S.C. Marksheet and Passing Certificate\n4\nLeaving / Transfer Certificate\n5\nCaste Certificate (if applicable)\n6\nCaste Validity Certificate (if applicable)\n7\nNon-creamy Layer Certificate (only for DT/VJ, NT, OBC, SBC)\n8\nMigration Certificate (if applicable)\n9\nDomicile Certificate\n10\nEquivalence Certificate (if applicable)\n11\nPhotocopy of Aadhar Card\n12\nGap Certificate (if applicable)\n13\nIncome Certificate (if applicable)\n14\nDuly signed printout of Anti-Ragging Affidavit submitted online on www.antiragging.in by Candidate and Parent\n15\nPrintout of duly signed University of Mumbai Pre-Admission Online Registration Form (mum.digitaluniversity.ac) with one set of all the above mentioned Documents (University's Institute Code: 561)\n16\nMHT CET/JEE Score Card\nNote\nFor the previously mentioned documents, all students have to hand in two (2) sets of attested photocopies.\nSince the original documents will only be given back to the students upon course completion, it is recommended that all students keep a suitable quantity of attested photocopies of all the documents they provided to the institution upon enrollment.\nBefore presenting their documents to the college for admission, all students must scan them. In order to submit these scanned documents for scholarships, etc., they must be uploaded.\nApplication Timeline:\nThe admission process for Computer Engineering at Pillai College of Engineering typically follows the MHT-CET and JEE Main merit system. Here are the tentative general key application milestones\n:\nMHT-CET Registration\n: Generally opens in early January.\nMHT-CET Exam Date\n: Usually held in May.\nCAP Rounds\n: Commence after the exam results, typically in June-July.\nAdmission Deadlines\n: Vary based on the schedules for CAP rounds and JEE Main results.\nNote\n:\nIt is essential for prospective students to stay updated on application openings, CAP round deadlines, and document verification periods each year.\nMeeting the eligibility criteria will help ensure a smooth admission process.\nTo stay informed about specific dates, students should regularly check the official MHT-CET website.\nBy keeping track of these important dates and requirements, students can effectively navigate their journey to admission at Pillai College of Engineering.\nApply Online\nFee Structure:\nFee Structure For Maharashtra State Board Students\nYEAR\nGENERAL\nOBC\nSC/ST\nSBC/DT/VJ/NT\nTFWS\nJ&K\nFIRST YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,37,360/-\n79,534/-\n4,360/-\n21,708/-\n21,708/-\nFee Structure For Other Than Maharashtra State Board Students\nYEAR\nGENERAL\nOBC\nSC/ST\nSBC/DT/VJ/NT\nTFWS\nJ&K\nFIRST YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,38,360/-\n80,534/-\n5,360/-\n22,708/-\n22,708/-\n29,360/-\nDIRECT SECOND YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,38,360/-\n80,534/\n5,360/-\n22,708/-\n--\n--\nExam Preparation Resources:\nComputer Science Engineering Syllabus in IIT Bombay:\nTextbooks:\nFocus on NCERT textbooks for Physics, Mathematics, and Chemistry, as they cover fundamental concepts essential for both MHT-CET and JEE Main.\nReference Books:\nPhysics: “Concepts of Physics” by H.C. Verma\nMathematics: “Objective Mathematics” by R.D. Sharma\nChemistry: “Organic Chemistry” by Morrison and Boyd\nOnline Resources:\nWebsites like Khan Academy, BYJU’S, and Unacademy offer video lectures and practice problems tailored for these entrance exams.\nPrevious Year Papers:\nSolve previous years’ question papers for MHT-CET and JEE Main to understand the exam pattern and frequently asked questions.\nMock Tests:\nRegularly take mock tests to build exam temperament and time management skills for securing a seat at the best Computer Science Engineering Colleges in Maharashtra.\nNote:\nFor practicing you can visit:\nmockcet.mes.ac.in\nTraining and Development Opportunities\nInternships and Industry Collaboration:\nPillai College of Engineering (PCE) is one of the top engineering institutes in Navi Mumbai for Computer Engineering. The college has strong collaborations with leading companies and industries, offering students opportunities to gain practical and theoretical knowledge. Our students are equipped with a solid foundation in core concepts and reasoning, while our dedicated placement cell works to connect them with top industry employers for internships.\nSome of these leading companies in collaboration with our college, who provide internships to our students are mentioned below:\nOur Industry Collaboration\nIndustry Collaborations\nMOUs signed with\nTristha Global Pvt. Ltd. Mumbai\nSaintiant Technologies\nCyber Secured India\nEKEEDA Pvt. Ltd.\nEXCELR Solution, Bengaluru, Karnataka\nAstroborne Space & Defence Technologies, Mumbai\nValue-added Courses\nPython and Development of Web Application using Flask Framework\nInternet of Things and Its Applications\nComplete Network Fundamentals: Mastering CCNA\nR Programming\nBlockchain Basics using Solidity Programming”\nPHP & MySQL\nValue Added Course on Tableau\nMobile Application Development\nStudent Chapters\nCSI:\nPCE’s\nCSI Student Chapter\noffers students a platform to enhance their technical skills, connect with industry professionals, and engage in career-oriented activities. Through workshops, seminars, coding competitions, and guest lectures, students stay updated with the latest trends in the IT world.\nThe chapter provides opportunities for hands-on learning, leadership development, and networking, helping students bridge the gap between academic knowledge and industry practices.\nGDG:\nThe\nGoogle Developer Group (GDG)\nat PCE helps students stay updated with the latest technologies by organizing workshops and seminars. It encourages creativity by hosting hackathons, coding competitions, and similar events. GDG also promotes teamwork through group projects and team-building activities.\nThe chapter also promotes teamwork through group projects and team-building activities, enhancing collaboration skills. Additionally, GDG facilitates guest lectures and networking events, offering students opportunities to connect with professionals and gain valuable real-world insights into their field.\nCareer Prospects for Graduates\nJob Opportunities After Graduation\nA degree in Computer Engineering unlocks opportunities in software development, hardware design, network systems, and emerging technologies. Graduates from top colleges in Navi Mumbai gain a competitive edge, opening doors to global careers in the dynamic field of computer engineering.\nData Scientist\nAnalyze large sets of structured and unstructured data to uncover insights and inform strategic decisions.\nBusiness Intelligence Analyst\nTransform data into actionable insights to support business decision-making and strategy.\nAI/ML/DL Engineer\nBuild and optimize artificial intelligence, machine learning, and deep learning models and systems.\nAI Ethics Consultant\nEnsure responsible and fair use of AI systems by evaluating ethical considerations and societal impacts.\nUX/UI Designer\nDesign user-friendly interfaces and enhance user experiences for digital products and applications.\nVR/AR Experience Designer\nCreate immersive virtual and augmented reality experiences that engage and inform users.\nConversational UX Designer\nDesign intuitive and human-like experiences for voice assistants, chatbots, and conversational AI.\nAI-Powered Robotics Developer\nDevelop intelligent robotic systems integrated with artificial intelligence for automation tasks.\nAutomation Engineer\nDesign systems that automate repetitive tasks across software, hardware, and manufacturing domains.\nDrone Software Developer\nCreate software that powers autonomous drones used in delivery, surveillance, and mapping.\nIoT (Internet of Things) Developer\nBuild smart devices and networks that connect and communicate through the internet.\nCybersecurity Analyst\nProtect digital systems and data by monitoring threats and implementing security measures.\nEthical Hacker (Penetration Tester)\nTest system vulnerabilities by simulating cyberattacks to identify and fix security flaws.\nIndustrial Visits organized\nIndustrial Visit to STPI, Pune organized by CSI-PCE\nIndustrial Visit to Opulent, Pune organized by CSI-PCE\nIndustrial Visit to CDAC, Pune organized by CSI-PCE\nIndustrial Visit to Cyber forensics Lab, Navi Mumbai.\nIndustrial Visit to ESDS SOFTWARE SOLUTION LIMITED Mahape, Navi Mumbai.\nPlacement Success Stories\nAverage package\noffered for Computer Engineering graduates at PCE is around 5-7 LPA.\nHighest package\noffered for a Computer Engineering graduate from Pillai College of Engineering is\n15 LPA\n.\nBrijeshkumar Singh, Batch of 2025, got placed at\nAllrin\nwith a CTC of 7 LPA.\nOm Sandeep Bothre, Batch of 2024, got placed at\nCapgemini\nas a software engineer with CTC of 6 LPA.\nShivam A Tripathi, Batch of 2025, got placed at\nCapgemini\nas a software engineer with CTC of 6 LPA.\nJyotirmay Janardan Prasad, Batch of 2025, got placed at\nCapgemini\nas a software engineer with CTC of 6 LPA.\n21 students from Batch of 2025 got placed at\nCapgemini\nwith a CTC of 6 LPA.\nPast placement records\nof Computer Engineering graduates at PCE:\nShreyan Pradeep Haldankar\n, Batch of 2024, got placed at\nImpact Analytics\nwith a CTC of 8.75 LPA.\nReshma Gopinathan, Vishnu Saseendran Nair, Ganesh Mohan Pillai\n, Batch of 2024, got placed at\nTCS\nwith 6 LPA.\nSanskruti Rajendra Salve\n, Batch of 2024, got placed at\nCapgemini\nwith 4 LPA.\n5 students from Batch of 2024 got placed at\nTCS\nthrough\nTCS Ninja\nwith 4 LPA.\n4 students from Batch of 2024 got placed at\nTCS\nthrough\nTCS Digital\nwith 4 LPA.\nAniket Surve, Chaitanya Zade, Arpita Nikam\n, Batch of 2024, got placed at\nAdenza\nwith a CTC of 8 LPA.\n8 students from Batch of 2023 got placed at TCS through TCS Ninja with 4 LPA.\n3 students from Batch of 2023 got placed at TCS through TCS Digital with 4 LPA.\nShivalika Pillai\n, Batch of 2023, got placed at\nReliance Jio-Illuminate\nwith a CTC of 7 LPA.\nVishwakarma Aakash Jaiprakash\n, Batch of 2023, got placed at\nReliance Jio-Illuminate\nwith a CTC of 7 LPA.\n21 students from Batch of 2021 got placed at\nCapgemini\nwith a CTC of 4 LPA.\nCapgemini, Accenture, TCS, Reliance’s Jio, ctrl S\nare the major companies conducting the Mass Requirement Drive for Pillai College of Engineering.\nInternship Success Stories\nAverage stipend\noffered for a Computer Engineering graduate at PCE is around 10-20K.\nHighest stipend\noffered for a Computer Engineering graduate from Pillai College of Engineering is\n20K\n.\nPast internship records\nof Computer Engineering graduates at PCE:\nSaras Shirgaonkar, Kamlesh Yadav, Atharv Bote\n, Batch of 2024, got internships at\nSuryoday Small Finance Bank Ltd., Newgen Software Technologies Ltd., etc.\n, with a stipend of\n20K\n.\nShreyan Haldankar\n, Batch of 2024, got an internship at\nImpact Analytics\nwith a stipend of\n15K\n.\nPriyanshu Chilkoti and Adheesh Sreedharan\n, Batch of 2024, got internships at\nLiving Things – An IoT Product Platform by iCap Tech, Tapmyads Technologies Pvt Ltd., etc.\n, with a stipend of 10K.\nA total of\n204\nstudents from the Batch of 2024 secured internships.\nOver 100 prestigious companies\noffered internships for the Batch of 2024 Computer Engineering students, including leading names like:\nMedtronic India Ltd., Reliance Jio Infocomm Ltd., Maharashtra Cyber, Bhabha Atomic Research Centre, Tech Mahindra Ltd., Newgen Software Technologies Ltd., Sutherland Global Services, Jio Platforms Ltd., and Acuradyne Medical Systems.\n12 Computer Engineering students\nfrom the Batch of 2024 received\nPre-Placement Offers (PPOs)\nfrom top companies, reflecting their skills and expertise in the field. Companies offering PPOs include:\nSutherland Global Services, Impact Analytics, Team India Managers Ltd, Newberry Group, Decentralized Planning Incorporated, Jio Financial Services, Aivanta, Sankey Solutions, NeoGrowth Credit Pvt. Ltd., Locuz Enterprise Solutions Ltd., Nimap Software Company, and ANM.\nOur Top Recruiters Include:\nAlumni Success Stories\nAlumni\nRahul Pinjani\nDesignation: Senior Software Engineer at Microsoft, Redmond, Washington, United States .\nGraduation Batch- 2011\nDetails :Rahul Pinjani appears to have a visionary approach to his work, evident in several key aspects such as Forward-Thinking in Technology Integration,Commitment to Innovation, Emphasis on Quality and Scalability, Focus on Enhanced User Experiences ,adaptability to Change and Overall, his work reflects a strong vision for leveraging cutting-edge technologies and design principles to create impactful, user-focused solutions that are both innovative and sustainable\nVinod Gupta\nDesignation: MS CSE Research Scholar at IIT Madras | Placement coordinator\nGraduation Batch- 2020\nDetails : Vinod Gupta demonstrates visionary qualities that lie in his dedication to research, focus on collaboration, mentorship, and strategic application of advanced technologies to solve meaningful problems. His proactive pursuit of learning, teaching, and innovation marks him as a forward-thinking contributor to the field.\nAshwini Khade\nDesignation:\nPrincipal Software Engineer at Microsoft San Francisco Bay Area\n.\nGraduation Batch- 2009\nDetails:\nAshwini Khade\nembodies visionary qualities through her work in AI, cloud computing, and embedded systems. Ashwini’s achievements reflect a strong technical foundation, innovative problem-solving skills, and a commitment to developing scalable, cutting-edge solutions. Her career trajectory, marked by leadership roles and impactful contributions, underscores her ability to shape and advance the future of technology across diverse industries.\nTejas Unnikrishnan\nDesignation: Data and AI Engineer | MSc Big Data Science from QMUL with 4+ years of experience as a Big Data Engineer. London, England, United Kingdom\nGraduation Batch- 2008\nDetails : Tejas Unnikrishnan’s visionary qualities and achievements are reflected in his extensive experience, innovative contributions, and ability to manage complex projects and teams.Tejas is a visionary leader in software development, adept at integrating cutting-edge technologies to solve complex problems across industries. The achievements reflect not only technical expertise but also a strategic mindset for creating scalable, efficient, and impactful solutions. He excels in innovation, collaboration, and driving long-term value in diverse and high-stakes environments.\nWhy Choose Pillai College of Engineering for Computer Engineering\nQuality of Education at PCE:\nPillai College of Engineering (PCE) is distinguished as one of the most exceptional institutions for B.Tech in Computer Engineering as a result of its comprehensive curriculum and rigorous accreditation. Our programs guarantee that students have a high-quality educational experience by adhering to strict educational requirements. PCE is one of the finest institutions in Navi Mumbai because its programs are approved by prestigious institutional authorities and fulfill national standards, which improves graduates’ employability and professional credibility.\nAffiliation and Approval:\nAffiliated to the University of Mumbai\nApproved by All India Council for Technical Education (AICTE), New Delhi\nRecognized by the Government of Maharashtra and DTE, Maharashtra\nGranted Autonomous Status by University Grants Commission (UGC), New Delhi from the academic year 2022-23\n4 UG courses are Permanently Affiliated with the University of Mumbai\nAccreditation:\nNAAC A+ grade\n3 UG courses re-accredited by NBA in 2015 and 2018\nState-of-the-Art Facilities\nState-of-the-Art Facilities\nInfrastructure and Facilities:\nPCE is built on a 16-acre lush green campus, featuring 2,30,000 sq. ft. of built-up area, and providing world-class resources for Computer Engineering students.\nKey Facilities Include:\nSmart Classrooms\nAuditorium\nSeminar Halls\nE-learning Studio\nResearch Centers\nLanguage Labs\nPillai Centre of Innovation and Entrepreneurship\nGreen Infrastructure (including E-waste Recycling, Rainwater Harvesting, and Solar Power Generation)\nPlastic Bottle Recycling Machine\nLabs Specifically Designed for Computer Engineering:\nArtificial Intelligence and Machine Learning Lab:\nEquipped with advanced computing infrastructure to support AI, ML, and DL projects.\nCenter of Excellence in 5G Communication (Advanced Communication Lab):\nFocused on RF and Microwave communication, supporting UG and PG experiments.\nCISCO Network Academy:\nA dedicated networking lab offering hands-on training in networking and IoT.\nDigital Electronics Lab:\nFor hands-on experience with digital circuits and systems.\nComputer Networking Lab:\nDesigned for practical experience in computer network design and troubleshooting.\nMicroprocessor Lab:\nOffers practical exposure to microprocessor-based system design and analysis.\nIndustrial Visits for Electronics Science:\nVisit to Cyber Crime Laboratory\nCSI Industrial Visit\nPersistent System, Pune\nFAQ’S\nIs Computer Engineering salary good?\nIndeed, there are prospects for high salaries in computer engineering. Graduates can anticipate competitive compensation, with salaries frequently increasing rapidly as they accumulate experience. At Pillai College of Engineering (PCE), our students are adequately equipped to enter the technology sector, as they are granted employment opportunities at prominent organizations such as Infosys, Amazon, and Capgemini. PCE guarantees that our graduates are prepared to establish successful careers and secure lucrative positions in the rapidly expanding field of computer engineering through ongoing training and robust industry relationships.\nIs Computer Engineering in demand?\nIndeed, there is a great demand for computer engineers. The demand for qualified computer engineers is always rising due to the quick development of software, data science, artificial intelligence, cybersecurity, and technology. Because we at Pillai College of Engineering (PCE) make sure our students have the newest technological skills and industry expertise, top organizations like Amazon, Infosys, and Jio highly value our graduates. Graduates of PCE programs are well-positioned to succeed in the rapidly changing IT sector with solid placements and ongoing support.\nWhich is better, CS or CE?\nThe choice between Computer Science (CS) and Computer Engineering (CE) is contingent upon individual interests and professional aspirations. If you are more predisposed to software development, programming, and data administration, Computer Science may be a more suitable choice. If you are interested in engaging with both hardware and software systems, such as designing computer hardware and integrating it with software, Computer Engineering (CE) may be the appropriate option.\nIs Computer Engineering a good course?\nIndeed, Computer Engineering is an exceptional discipline that offers significant career prospects. It integrates data science, hardware systems, and software development, providing access to a diverse array of employment opportunities in the fields of cybersecurity, artificial intelligence, and technology. At Pillai College of Engineering (PCE), we guarantee that our graduates are adequately equipped to pursue prosperous careers in the expanding technology sector by offering state-of-the-art education, industry-specific training, and robust placement assistance. Computer Engineering provides a promising future, regardless of whether one aspires to work for top-tier technology companies or innovative enterprises.\nWhich is the best course in computer engineering?\nThe optimal course in computer engineering depends on personal interests. Common selections encompass Artificial Intelligence (AI), Machine Learning (ML), Robotics, Data Science, and Cybersecurity. Courses such as Embedded Systems, Computer Architecture, and Internet of Things (IoT) are highly suggested for anyone interested in a combination of hardware and software.\nWhich CS branch is best?\nThe primary disciplines of Computer Science encompass Artificial Intelligence, Machine Learning, Software Engineering, Cybersecurity, and Data Science. The optimal branch is contingent upon your preference for theoretical endeavors, like as algorithm development, or practical applications, including programming or constructing secure systems.\nHow much is the salary of a computer science engineer?\nComputer engineering can be difficult since it requires understanding both hardware and software ideas. Circuits, programming, and system architecture courses all require excellent problem-solving abilities. However, for people who are enthusiastic about technology, it may be a great and gratifying career.\nIs computer engineering very tough?\nComputer engineering can be difficult since it requires understanding both hardware and software ideas. Circuits, programming, and system architecture courses all require excellent problem-solving abilities. However, for people who are enthusiastic about technology, it may be a great and gratifying career.\nFaculty:\nComputer Engineering Faculty\nDr. Sharvari S. Govilkar\nsgovilkar@mes.ac.in\nDr. Jyoti S. Deshmukh\njyotideshmukh@mes.ac.in\nDr. Mimi M. Cherian\nmcherian@mes.ac.in\nDr. Amin Dhiraj\namindhiraj@mes.ac.in\nDr. Ankita V. Pandit\nankitapandit@mes.ac.in\nDr. Gopinath Karmakar\ngopinathkarmakar@mes.ac.in\nVarunakshi S. Bhojane\nvarunakshi_k@mes.ac.in\nPayel G. Thakur\npayelthakur@mes.ac.in\nKrishnendu S. Nair\nknair@mes.ac.in\nDeepti Lawand\ndlawand@mes.ac.in\nK. S. Suresh Babu\nsureshbabu@mes.ac.in\nK. S. Charumathi\nkscharumathi@mes.ac.in\nSangeetha Selvan\nsangeethas@mes.ac.in\nBhagyashri Patil\nbhagyashripatil@mes.ac.in\nShubhangi Chavan\nsrathod@mes.ac.in\nSheetal Shimpikar\nsheetalshimpikar@mes.ac.in\nSavita K. Sawant\nsavitasawant@mes.ac.in\nPriyanka P. Sherkhane\npriyankasherkhane@mes.ac.in\nPooja B. Bhise\npoojabhise@mes.ac.in\nMegha Mohan\nmeghamohan@mes.ac.in\nRadhika Fulzele\nradhikafulzele@mes.ac.in\nManasi S. Kulkarni\nmjoshi@mes.ac.in\nAshwini D. Mate\nashwinimate@mes.ac.in\nKirti Rana\nkirtirana@mes.ac.in\nRashmi Gourkar\nrashmigourkar@mes.ac.in\nNeha Ashok\nnehaashok@mes.ac.in\nFaculty:\nComputer Engineering Faculty\nDr. Sharvari S. G\nsgovilkar@mes.ac.in\nDr. Jyoti S. Deshmukh\njyotideshmukh@mes.ac.in\nMimi M. Cherian\nmcherian@mes.ac.in\nDr. Amin Dhiraj\namindhiraj@mes.ac.in\nDhiraj Amin\namindhiraj@mes.ac.in\nDr. Ankita V. Pandit\nankitapandit@mes.ac.in\nDr. Gopinath Karmakar\ngopinathkarmakar@mes.ac.in\nVarunakshi S. Bhojane\nvarunakshi_k@mes.ac.in\nPayel G. Thakur\npayelthakur@mes.ac.in\nKrishnendu S. Nair\nknair@mes.ac.in\nDeepti Lawand\ndlawand@mes.ac.in\nK. S. Suresh Babu\nsureshbabu@mes.ac.in\nK. S. Charumathi\nkscharumathi@mes.ac.in\nSangeetha Selvan\nsangeethas@mes.ac.in\nBhagyashri Patil\nbhagyashripatil@mes.ac.in\nShubhangi Chavan\nsrathod@mes.ac.in\nSheetal Shimpikar\nsheetalshimpikar@mes.ac.in\nSavita K. Sawant\nsavitasawant@mes.ac.in\nPriyanka P. Sherkhane\npriyankasherkhane@mes.ac.in\nPooja B. Bhise\npoojabhise@mes.ac.in\nMegha Mohan\nmeghamohan@mes.ac.in\nRadhika Fulzele\nradhikafulzele@mes.ac.in\nManasi S. Kulkarni\nmjoshi@mes.ac.in\nAshwini D. Mate\nashwinimate@mes.ac.in\nKirti Rana\nkirtirana@mes.ac.in\nRashmi Gourkar\nrashmigourkar@mes.ac.in\nNeha Ashok\nnehaashok@mes.ac.in\nApply For Admission\nPCE\n©\nMES\n| Designed by\nVidyadhan Educational Development Private Limited\nCampuses:\nPANVEL |\nNEW PANVEL\n|\nKHANDA\n|\nRASAYANI\n|\nGORAI\n|\nCHEMBUR\nPillai Group of Institutions\nOnline\nWelcome to Pillai Group of Institutions!\nClick on Start Chat and Just say Hi!\nStart Chat\nChat with us\nStart Your Engineering Journey at PCE\nFill the Admission Enquiry Form\nName\n*\nPhone Number\n*\nEmail\n*\nCET Score\nField of Interest\n*\nSelect a Course\nAutomobile Engineering\nComputer Engineering\nElectronics and Computer Science\nElectronics and Telecommunication\nInformation Technology\nMechanical Engineering\nSubmit",
  "tables": [
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Automobile Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Computer Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Computer Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Computer Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Electronics & Computer Science",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Electronics Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Electronics Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "EXTC Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Information Technology",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Information Technology",
        "Masters Degree",
        "2 years"
      ],
      [
        "Information Technology",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Mechanical Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Mechanical Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Mechanical Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "ASM",
        "Bachelor Degree",
        "1 year"
      ]
    ],
    [
      [
        "Affiliated to",
        "Duration",
        "Academic Year",
        "Intake",
        "Theory Exam",
        "Curriculum"
      ],
      [
        "University of Mumbai",
        "4 years, Full Time",
        "2 semesters each",
        "180",
        "University of Mumbai",
        "Link"
      ]
    ],
    [
      [
        "Sr. No.",
        "Documents"
      ],
      [
        "1",
        "ARC (CAP) Allotment Letter (FC Registration Form in case of Institute Level and Against CAP Admission)"
      ],
      [
        "2",
        "S.S.C. Marksheet and Passing Certificate"
      ],
      [
        "3",
        "H.S.C. Marksheet and Passing Certificate"
      ],
      [
        "4",
        "Leaving / Transfer Certificate"
      ],
      [
        "5",
        "Caste Certificate (if applicable)"
      ],
      [
        "6",
        "Caste Validity Certificate (if applicable)"
      ],
      [
        "7",
        "Non-creamy Layer Certificate (only for DT/VJ, NT, OBC, SBC)"
      ],
      [
        "8",
        "Migration Certificate (if applicable)"
      ],
      [
        "9",
        "Domicile Certificate"
      ],
      [
        "10",
        "Equivalence Certificate (if applicable)"
      ],
      [
        "11",
        "Photocopy of Aadhar Card"
      ],
      [
        "12",
        "Gap Certificate (if applicable)"
      ],
      [
        "13",
        "Income Certificate (if applicable)"
      ],
      [
        "14",
        "Duly signed printout of Anti-Ragging Affidavit submitted online on www.antiragging.in by Candidate and Parent"
      ],
      [
        "15",
        "Printout of duly signed University of Mumbai Pre-Admission Online Registration Form (mum.digitaluniversity.ac) with one set of all the above mentioned Documents (University's Institute Code: 561)"
      ],
      [
        "16",
        "MHT CET/JEE Score Card"
      ]
    ],
    [
      [
        "YEAR",
        "GENERAL",
        "OBC",
        "SC/ST",
        "SBC/DT/VJ/NT",
        "TFWS",
        "J&K"
      ],
      [
        "FIRST YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,37,360/-",
        "79,534/-",
        "4,360/-",
        "21,708/-",
        "21,708/-",
        ""
      ]
    ],
    [
      [
        "YEAR",
        "GENERAL",
        "OBC",
        "SC/ST",
        "SBC/DT/VJ/NT",
        "TFWS",
        "J&K"
      ],
      [
        "FIRST YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,38,360/-",
        "80,534/-",
        "5,360/-",
        "22,708/-",
        "22,708/-",
        "29,360/-"
      ],
      [
        "DIRECT SECOND YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,38,360/-",
        "80,534/",
        "5,360/-",
        "22,708/-",
        "--",
        "--"
      ]
    ]
  ],
  "character_count": 35005
}