{
  "page_name": "Hostel",
  "url": "https://www.pce.ac.in/about/infrastructure-and-facilities/hostel-facility/",
  "scraped_at": "2025-10-30T17:13:07.311932",
  "text_content": "Hostel Facility\nThe Pillai Group of Institutions seeks to make high quality education accessible to everyone regardless of their location. Since 2010, all those associated with the Mahatma Education Society have enjoying access to the modern, excellent Pillai hostel facilities of Panvel. Each hostel building has been designed to create the perfect study environment as well as a place in which students can pursue their personal talents including sports and other extracurricular activities. All hostel facilities are located close to the college itself making it very convenient for all staff and students!. At Pillai’s hostel, you can enjoy the metropolitan location of Mumbai in the quiet suburban setting of Panvel. Located within walking distance of campus, Pillai Hostels provides a peaceful setting in which academia is combined with extra-curricular activities in one friendly environment.\nPillai Group of Institutions offers\nseparate hostels\nfor boys and girls with\nvarious rooms\navailable for students to choose from. Single bed rooms with AC are available upon request.\nGirls Hostel\nBoys Hostel\nDouble Rooms and Six Bed Dormitories available!\nFull Capacity: 300 students\nview details (.pdf)\nTriple Rooms, Double Rooms and Single Rooms available!\nFull Capacity: 380 students\nview details (.pdf)\nAddress:\nPillai Girls Hostel\nPlot No. 21, Sector 16\nNew Panvel, Navi Mumbai - 410206\nAddress:\nPillai Boys Hostel\nPlot No. 5 and 6, Sector 13\nKhanda Colony, Navi Mumbai - 410206\nJoin more than 600 students located close to Panvel Campus currently benefiting from the Pillai Hostel facilities. AC options are available.\nAll prospective residents interested in joining the hostel may arrange a tour with one of our friendly staff members.\nPlease Contact: 9167103484\nMES Pillai Hostels\nApplication Form\nmay be filled out once applicant has contacted the Pillai Hostel Facility.\nWe have many facilities available to ensure residents are comfortable and satisfied:\nHostel Canteen offering Breakfast, Lunch and Dinner\nAnnual Meal Plans Available\nDaily Cleaning Service Available\n24/7 Security Personnel and CCTV\nFast Wifi Connection\nSocial Areas\nAnother facility is the\ncaring student community\nwhich exists in every Pillai Hostel. Hostel life is an opportunity to socialise with students from all over India in the urban hub of Navi Mumbai.\nPCE\n©\nMES\n| Designed by\nVidyadhan Educational Development Private Limited\nCampuses:\nPANVEL |\nNEW PANVEL\n|\nKHANDA\n|\nRASAYANI\n|\nGORAI\n|\nCHEMBUR\nPillai Group of Institutions\nOnline\nWelcome to Pillai Group of Institutions!\nClick on Start Chat and Just say Hi!\nStart Chat\nChat with us",
  "tables": [
    [
      [
        "Girls Hostel",
        "Boys Hostel"
      ],
      [
        "Double Rooms and Six Bed Dormitories available!Full Capacity: 300 studentsview details (.pdf)",
        "Triple Rooms, Double Rooms and Single Rooms available!Full Capacity: 380 studentsview details (.pdf)"
      ],
      [
        "Address:Pillai Girls HostelPlot No. 21, Sector 16New Panvel, Navi Mumbai - 410206",
        "Address:Pillai Boys HostelPlot No. 5 and 6, Sector 13Khanda Colony, Navi Mumbai - 410206"
      ]
    ]
  ],
  "character_count": 2621
}