{
  "page_name": "IT Engineering",
  "url": "https://www.pce.ac.in/academics/bachelors/information-technology/",
  "scraped_at": "2025-10-30T17:12:14.697060",
  "text_content": "Departments\nAutomobile Engineering\nProgram\nLevel\nDuration\nAutomobile Engineering\nBachelor Degree\n4 years\nComputer Engineering\nProgram\nLevel\nDuration\nComputer Engineering\nBachelor Degree\n4 years\nComputer Engineering\nMasters Degree\n2 years\nComputer Engineering\nPh.D. Program\n3 years\nElectronics & Computer Science\nProgram\nLevel\nDuration\nElectronics & Computer Science\nBachelor Degree\n4 years\nElectronics Engineering\nMasters Degree\n2 years\nElectronics Engineering\nPh.D. Program\n3 years\nElectronics & Telecommunication\nProgram\nLevel\nDuration\nEXTC Engineering\nBachelor Degree\n4 years\nInformation Technology\nProgram\nLevel\nDuration\nInformation Technology\nBachelor Degree\n4 years\nInformation Technology\nMasters Degree\n2 years\nInformation Technology\nPh.D. Program\n3 years\nMechanical Engineering\nProgram\nLevel\nDuration\nMechanical Engineering\nBachelor Degree\n4 years\nMechanical Engineering\nMasters Degree\n2 years\nMechanical Engineering\nPh.D. Program\n3 years\nApplied Science and Mathematics\nProgram\nLevel\nDuration\nASM\nBachelor Degree\n1 year\nAdmissions\nDSE Notice – Vacant seats and Merit List\nNotice 8/9/25- IL/Vacant seats and Merit List\nF.E. Documents List 2025-26\nScholarship Details\nB.Tech. DSE Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nB.Tech. F.E. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM.Tech. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM. Tech. IL & ACAP Admission\nImportant Admission Notice\nApply Online (FE only)\nOnline Portal\nPCE MOCK CET Online Portal\nPCE Online Student Portal\nPCE ASK (Attitude Skills and Knowledge) Portal\nPCE Online Library Portal\nConnect with us\nFacebook\nTwitter\nYouTube\nInstagram\nLinkedIn\nStudent Associations\nInformation Technology\nIntroduction\nProgram Overview\nAdmission Process\nExams\nTraining and Development\nCareer Prospects\nWhy Choose Pillai College\nFAQs\nAbout Information Technology\nFees Structure\nFaculty\nLab\nIntroduction\nOverview:\nThe Department of Information Technology is dedicated to advancing the frontiers of knowledge and innovation in computing and digital technologies. With a strong foundation in emerging fields such as Artificial Intelligence (AI) and Robotics, Infrastructure Security, Bioinformatics, Internet of Things (IoT), and Data Analytics, the department equips students with cutting-edge skills to address complex global challenges. By integrating theoretical knowledge with practical applications we ensure that our graduates are prepared to lead in the ever-evolving technological landscape.\nInformation Technology plays a critical role in shaping modern industries and improving the quality of life through digital transformation. The department fosters an interdisciplinary approach, blending computing principles with applications in healthcare, cybersecurity, automation, and data-driven decision-making. Our faculty and researchers work on innovative projects that contribute to technological advancements, ensuring that our students gain hands-on experience in solving real-world problems.\nWhy Information Technology is a Critical Field in Navi Mumbai:\nIT majors are set to increase their workforce in accordance to expanding demand for Information Technology services. The Information Technology (IT) industry is a vital component of the technology driven knowledge economy of the 21st century. The role of IT in India has been imperative. The role of Information Technology has grown rapidly due to the role of IT in the economic development in India.\nComing to the future of tech jobs in Navi Mumbai :\nNavi Mumbai’s Information Technology job rate is booming significantly with a notable 32.5% increase. Covid 19 spurred remote work trends which led to reshaping job dynamics. Navi Mumbai is also known as India’s economic powerhouse and has started showcasing its trending tech hub. Initially what used to be known as financial capital has set its footing in the technology sector as well. Furthermore Navi Mumbai has developed into one of India’s leading hubs for cloud service as well in recent years..\nInformation Technology (IT)\nDefinition and Scope:\nInformation technology (IT) engineering is the practice of designing, maintaining, and managing information technology systems using technical and social skills. IT engineers work with hardware and software to ensure that a company’s technology is functioning properly and is beneficial to the business.\nVision:\nTo become a reputable world-class institution that is responsive to national, regional and global development needs through engagement in dynamic knowledge creation, innovation and application.\nMission:\nTo expand the frontiers of knowledge through provision of excellent conditions for teaching-learning and research\nTo produce graduates who are worthy in character and sound judgments.\nTo contribute to the transformation of society through creativity and innovation.\nTo serve as a dynamic custodian of society’s salutary values and thus sustain its integrity.\nCourses Offered at Pillai College of Engineering\nBachelor’s degree in Information Technology Structure\n:\nBachelor of Engineering in IT is a 4 year undergraduate program (8 semesters) in the domain of computer science with specialization in the area of Information Technology and its related subjects. The minimum requirement each university or institute asks for is the score of at least 55% at 10+2 or equivalent level.\nSome of the interesting areas in this domain are Cloud Computing, Machine Learning, Cyber Security, Digital Forensics, Computer Networks, Mobile Adhoc Networks, Image Processing and Machine vision and many more.\nStudents who are interested in Information technology studies, software testing or who wanna pursue a career in this domain can opt for this course.The core subjects basically include fundamental topics necessary for a solid IT foundation. The subjects are Engineering Mathematics, Applied Physics – (Modern Chemistry), Applied Chemistry, Engineering Mechanics, Data Structure using C, Engineering Graphics, Database Management Systems and more.\nAffiliated to\nDuration\nAcademic Year\nIntake\nTheory Exam\nCurriculum\nUniversity of Mumbai\n4 years, Full Time\n2 semesters each\n120\nUniversity of Mumbai\nSem I - VIII\nCourses offered at Pillai College of Engineering:\nPillai College of Engineering is one of the best engineering colleges in Navi Mumbai providing with one of the best Information Technology courses in Mumbai Here at Pillai College of Engineering, the Bachelors in Information Technology department provides with the set of knowledge that will enable students to develop faster hardware components, new communication and software systems and also with design of digital hardware and software systems amongst many others.\nDepartment Level Specialization\nAI and Robotics\nIoT and Data Analytics\nInformation Security and Forensics\nBioinformatics\nInstitute Level Specializations\nEntrepreneurship Development and Management\nBusiness Management\nIP Management\nBioengineering\nBio Instrumentation\nEngineering Design\nSustainable Technologies\nContemporary Studies\nArt and Journalism\nApplied Science\nGreen Technologies\nMaintenance Engineering\nLife Skills\nEnvironment & Safety\nResearch Areas:\nThe Faculty of the Department of Information Technology are experts in numerous disciplines and are involved in following research areas:\nComputer Networks\nDatabases\nBig Data Analytics\nCyber Security\nNatural Language Processing\nGeographic Information Systems\nAdmission Process for Information Technology\nAdmission Requirements:\nPassed HSC, and physics and mathematics are compulsory subjects along with chemistry, biotechnology, computer science or information technology and achieved at least 45% marks in the aforementioned subjects.\nThe candidate should have appeared in MH CET or JEE Main (B.E/ B TECH) and achieved a non-zero score.\nCandidates with a Diploma in Engineering and Technology are also eligible, provided they have obtained at least 45% marks (40% for certain categories).\nNote:\nCutoff for Information Technology 2024-25 at Pillai College was 89.68 percentile.\nDocuments Required:\nThe\ndocuments\nnecessary to complete the admission process include the following:\nSr. No.\nDocuments\n1\nARC (CAP) Allotment Letter (FC Registration Form in case of Institute Level and Against CAP Admission)\n2\nS.S.C. Marksheet and Passing Certificate\n3\nH.S.C. Marksheet and Passing Certificate\n4\nLeaving / Transfer Certificate\n5\nCaste Certificate (if applicable)\n6\nCaste Validity Certificate (if applicable)\n7\nNon-creamy Layer Certificate (only for DT/VJ, NT, OBC, SBC)\n8\nMigration Certificate (if applicable)\n9\nDomicile Certificate\n10\nEquivalence Certificate (if applicable)\n11\nPhotocopy of Aadhar Card\n12\nGap Certificate (if applicable)\n13\nIncome Certificate (if applicable)\n14\nDuly signed printout of Anti-Ragging Affidavit submitted online on www.antiragging.in by Candidate and Parent\n15\nPrintout of duly signed University of Mumbai Pre-Admission Online Registration Form (mum.digitaluniversity.ac) with one set of all the above mentioned Documents (University's Institute Code: 561)\n16\nMHT CET/JEE Score Card\nNote:\nFor the previously mentioned documents, all students have to hand in two (2) sets of attested photocopies.\nSince the original documents will only be given back to the students upon course completion, it is recommended that all students keep a suitable quantity of attested photocopies of all the documents they provided to the institution upon enrollment.\nBefore presenting their documents to the college for admission, all students must scan them. In order to submit these scanned documents for scholarships, etc., they must be uploaded.\nApplication Timeline:\nThe admission process for\nInformation Technology\nat\nPillai College of Engineering\ntypically follows the MHT-CET and JEE Main merit system. Here are the tentative general key application milestones:\nMHT-CET Registration\n: Generally opens in early January.\nMHT-CET Exam Date\n: Usually held in May.\nCAP Rounds\n: Commence after the exam results, typically in June-July.\nAdmission Deadlines\n: Vary based on the schedules for CAP rounds and JEE Main results.\nNote\n:\nIt is essential for prospective students to stay updated on application openings, CAP round deadlines, and document verification periods each year.\nMeeting the eligibility criteria will help ensure a smooth admission process.\nTo stay informed about specific dates, students should regularly check the official MHT-CET website.\nBy keeping track of these important dates and requirements, students can effectively navigate their journey to admission at Pillai College of Engineering.\nApply Online\nFee Structure:\nFee Structure For Maharashtra State Board Students\nYEAR\nGENERAL\nOBC\nSC/ST\nSBC/DT/VJ/NT\nTFWS\nJ&K\nFIRST YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,37,360/-\n79,534/-\n4,360/-\n21,708/-\n21,708/-\nFee Structure For Other Than Maharashtra State Board Students\nYEAR\nGENERAL\nOBC\nSC/ST\nSBC/DT/VJ/NT\nTFWS\nJ&K\nFIRST YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,38,360/-\n80,534/-\n5,360/-\n22,708/-\n22,708/-\n29,360/-\nDIRECT SECOND YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,38,360/-\n80,534/\n5,360/-\n22,708/-\n--\n--\nExam Preparation Resources:\nInformation Technology (IT)\nEngineering Syllabus in Bombay:\nTextbooks:\nFocus on NCERT textbooks for Physics, Mathematics, and Chemistry, as they cover fundamental concepts essential for both MHT-CET and JEE Main.\nReference Books:\nPhysics: “Concepts of Physics” by H.C. Verma\nMathematics: “Objective Mathematics” by R.D. Sharma\nChemistry: “Organic Chemistry” by Morrison and Boyd\nOnline Resources:\nWebsites like Khan Academy, BYJU’S, and Unacademy offer video lectures and practice problems tailored for these entrance exams.\nPrevious Year Papers:\nSolve previous years’ question papers for MHT-CET and JEE Main to understand the exam pattern and frequently asked questions.\nMock Tests:\nRegularly take mock tests to build exam temperament and time management skills for securing a seat at the best Computer Science Engineering Colleges in Maharashtra.\nNote:\nFor practicing you can visit:\nmockcet.mes.ac.in\nTraining and Development Opportunities\nInternships and Industry Collaboration:\nPillai College of Engineering has established a robust placement record , with consistently achieving impressive outcomes for its students. The college’s strong collection with industry and particularly in the IT sector, plays a crucial role in its placement success. With also having their placement committee in the field, they ensure a wide range of opportunities.\nPillai College of Engineering boasts a high placement rate, which led to a  majority of students securing jobs in reputable companies. The college’s placement cell schedules mock interviews, resume workshops and skill development sessions.\nThe department of Information Technology of Pillai College is one of the best in Navi Mumbai at securing placements that are best suited for their students.\nSoft skill development program by INFOSYS\nSome of the past placements for Information Technology are:\nTCS Placements with an annual salary of 7 Lakhs per annum.\nGunnebo Placements with an annual salary of 7 Lakhs per annum.\nDeloitte Placements with an annual salary of  6.90 Lakhs per annum.\nAllerin Placements with an annual salary of 5 Lakhs per annum.\nEmphasis Placements with an annual salary of 5 LPA.\nSystenics Solutions Placements, Accelya Placements,\nWTW Placements and many more.\nAverage stipend\noffered for an Information Technology  graduate at PCE is around 10-20K.\nHighest stipend\noffered for an Information technology graduate from Pillai College of Engineering is\n25K\n.\nPast Internship records\nof Information Technology graduates at PCE:\nOm Surve, Batch of 2024, got an international  internship at Fusion Cyber with a stipend of 25K per month.\nA total of 132 students from the Batch of 2024 secured internships in various esteemed organizations namely\nIITB, Acuradyne Systems, IITB Nano Sciences/ Bio Sciences Lab, Medtronic, Cyber Secured India, Qspider, Fusion Cyber,Sankey solutions, etc\n71 companies offered internships for the year 2024.\nFee students who got paid internship are Lucky Pannu with 12K per month, Om Surve with 25K per month, Yash Patil with 12K per month, Gopika with 15K per month, Kashish with 5K per month, Kunal Wagh with 15K per month and Omkar Raul with 5K per month.\nSome of these leading companies in collaboration with our college, who provide internships to our students are mentioned below:\nOur Industry Collaboration\nBest Information Technology Training Institutes in Navi Mumbai Region:\nSkill Enhancement programs facilitated by PCE\n:\nIIT Bombay Remote Center:\nOur College is a Remote center for IIT Bombay with a rating of 4 stars. It helps to keep in touch with the contemporary technical skills of students and teaching skills of faculty colleagues in core Engineering and Science subjects both physically and virtually.\nMoU with CYBER SECURED INDIA\nValue added course on IoT and its Application:\nInstitute conducts Value added course such as IoT and its Application\nInstitute conducts various value-added courses\nto enhance the teaching and learning experience making our college one of the best computer institutes in Panvel & Navi Mumbai.\nCertification Programs:\nFinite Element Analysis\nPython and Development of Web\nApplication using Flask Framework Internet\nof Things and Its Applications\nCATIA V5 Mechanical Designer\nComplete Network Fundamentals\n:\nMastering CCNA\nMobile Application Development\nAugmented Reality\nand Virtual Reality Introduction to Remote Sensing & GIS and many more.\nGlobal Certification\nProgram on\nSolidworks at the level of Associate (CSWA\n)\nGlobal Certification Program on Solidworks at the\nlevel of Professional (CSWP)\nPCE Value Added / Certificate Programs | PCE\nStudent Clubs:\nGDG PCE\n: Google-supported student community at Pillai College of Engineering,dedicated to promoting learning and innovation around Google technologies and other essential tech domains. With guidance and resources provided directly by Google, GDG PCE serves as a platform for students to explore advanced tools and technologies.\nGoogle Developer Groups GDG on Campus Pillai College of Engineering – Navi  Mumbai, India\nCSI PCE:\nThe Computer Society of India is a leading technical organization dedicated to fostering innovation and technical excellence among students. CSI has long been recognized for its commitment to enhancing students’ knowledge and skills. The CSI and PCE have successfully collaborated for many years to guide students on their chosen career paths. Various workshops and seminars introducing students to new technology and professional opportunities take place on PCE campus via CSI among other reputed organizations.\nCSI-PCE\nIEEE PCE:\nThe Institute of Electrical and Electronic Engineers is the inspiration of a global community & the trusted voice of engineering, computing and technology information societies around the world. PCE works directly with IEEE to provide students with a basic level of technical understanding as well as to stimulate a natural curiosity for their profession. PCE institution is proud to be affiliated with the IEEE so that we may provide students an in-depth theoretical knowledge to further develop an intuitive practical approach in the field of technology.\nCareer Prospects for Graduates\nJob Opportunities After Graduation\nIT career paths are just not limited to technical aspects, it has various jobs as well. IT opens a wide range of career paths that one can choose and pursue as their career, i.e., from cloud computing to computer support and many more. With the rapidly evolving technology especially within the realm of Information Technology, especially in the Information Technology in Navi Mumbai, there are many career opportunities that the students can explore.\nSoftware Development and Engineering\nBuild and maintain software solutions.\nData Science and Analytics\nAnalyze and interpret data insights.\nCybersecurity\nSafeguard systems from security threats.\nCloud Computing\nManage cloud-based applications and services.\nArtificial Intelligence (AI) and Machine Learning (ML)\nDevelop intelligent systems and algorithms.\nBlockchain Development\nCreate secure blockchain-based solutions.\nInternet of Things (IoT)\nDevelop interconnected smart devices and systems.\nBioinformatics\nBioinformatics applies computing to analyze and manage genetic data like DNA and protein sequences..\nProject Management (IT)\nOversee and execute IT projects.\nComputer Support\nTroubleshoot and maintain computer systems.\nOf course, the options are not limited to just these. The department of technology is vast, and there are many more areas to explore.\nPlacement Success and Industry Partnerships\nPillai College of Engineering has established a robust placement record, consistently achieving impressive outcomes for its students. The college’s strong connection with the industry, particularly in the IT sector, plays a crucial role in its placement success. With an active placement committee, the college ensures a wide range of opportunities.\nPillai College of Engineering boasts a high placement rate, with a majority of students securing jobs in reputable companies. The college’s placement cell schedules mock interviews, resume workshops, and skill development sessions. The Department of Technology at Pillai College is one of the best in Navi Mumbai for securing placements that are best suited for their students.\nPlacement Highlights:\nAvg highest package:\n10 Lakhs per annum\nHighest package:\nThe highest package offered for an Information Technology graduate from Pillai College of Engineering is\n10 Lakhs per annum\n.\nPast placement records:\nSome notable placements for Information Technology graduates at PCE:\nDhruvang Choudhry\n, Batch of 2025, got placed at\n9GAG\nwith a\nCTC of 10 LPA\n.\nAkanksha Rajendra Deogharkar & Sahana Santosh Godale, Batch of 2024, got placed at\nCapgemini\nwith CTC of 4.25 / 7 LPA.\n4 students from Batch of 2024, got placed at\nTCS DIGITAL\nwith CTC of 7 LPA.\nSaakshi Santosh Sharma, Batch of 2024, got placed at\nArise Infra Solutions Pvt. Ltd\nwith CTC of 7.75 LPA.\nRohit Rana, Batch of 2024, got placed at\nGray Space Digital\nwith CTC of 6.6 LPA.\nNitish Palanivelu, Batch of 2024, got placed at\nSciative Solutions\nwith CTC of 6 LPA.\nVaishnavi Nanaware, Batch of 2024, got placed at\nDassault Systemes Solutions Lab Pvt. Ltd.\nwith CTC of 6 LPA.\n4 students from Batch of 2024, got placed at\nTCS NINJA\nwith CTC of 3.36 LPA.\n3 students from Batch of 2024, got placed at\nCitiusTech\nwith CTC of 5.5 LPA.\nOur Top Recruiters Include:\nAlumni Success Stories\nGaurav Thakur\nSenior Manager at Deloitte Digital | Mumbai Studio Lead\nSeasoned digital experience mobile leader with expertise in driving innovative strategies and delivering impactful solutions. Passionate about leveraging technology to enhance user experiences and drive business growth. Skilled in team leadership, product development, and customer-centric approaches\nPiyush Saxena\nSoftware Engineer at Meta Bellevue, Washington, United States\nPiyush has excelled as a Software Engineer. He brings a systems, top down, analysis to the code being developed. He collaborates excellently with his peers and develops software that scales and integrates seamlessly. As part of agile/scrum teams, he constantly worked to find the proper balance of functionality and validation so that the product was always in a shippable state. His enthusiasm to learn and pursue excellence is one of his best qualities.\nPoornima Seetharaman\nDesignation: :Game Designer, WIGJ Hall of Fame Winner, Women in Games Ambassador, WIGIN,Founder, TEDx Speaker, Featured in Rebel Girls – Level Up Edition\nPoornima has been part of the gaming industry since 2006 and has worked with some of the best names in the Indian gaming industry, including Indiagames (Disney India) [where she got the opportunity to work on Bioshock Mobile], Jumpstart (NetDragon), GSN Games, Square Enix etc. She found game dev by chance, but chose it as her career completely out of her passion for games and translated that passion further by co-founding Pinaka Interactive (a game design studio) and NammaLore Entertainment (a game development studio).\nBiju Chandran\nFounder at Binaryveda\nBiju Chandran was captivated by stories while growing up, especially the Malayalam films from the golden era and riveting books. Academically inclined, he naturally ventured into Information Technology, where he discovered a profound love for coding. To Biju, coding wasn’t just logic—it was an art form, a way to weave digital stories.\nWhy Choose Pillai College for Information Technology?\nBest Computer Science Mumbai University:\nQuality of Education at PCE :\nOur college stands out as one of the best colleges for B. Tech in Information Technology due to its rigorous accreditation, which ensures that our programs adhere to high educational standards and deliver a curriculum that is comprehensive. Being approved by top institutional bodies, ensures that our programs meet national benchmarks and guarantees a quality learning experience, enhancing our graduates’ employability and credibility in the professional world, thus making our college one of the top colleges in Navi Mumbai.\nAffiliation and Approval\nAffiliated to the University of Mumbai\nApproved by All India Council for Technical Education (AICTE), New Delhi.\nRecognized by the Government of Maharashtra and DTE, Maharashtra.\nGranted Autonomous Status by University Grants Commission, New Delhi from the academic year 2022-23.\n4 UG courses are Permanently Affiliated with the University of Mumbai\nAccreditation\nNAAC A+ grade\n3 UG courses were Re-accredited in 2015 and in 2018 by NBA\nState-of-the-Art Facilities\nInfrastructure and Facilities:\nHere at Pillai College of Engineering, Department of Information Technology provides numerous specialized labs catered to the student’s needs and to enhance their learning experience. Labs such as:\nCloud and Big Data\nAdvanced Network\nNetwork\nInternet and Web Technology\nDSP and Image Processing\nSystem Software\nArtificial Intelligence / Software Testing\nSoftware Engineering\nThese labs feature advanced technologies and tools which will allow students to have dynamic and practical learning. Pillai College of Engineering is one of the leading Navi Mumbai Institute of Information Technology.\nHighly Qualified Faculty and Research Opportunities:\nWith advanced specialized labs, Pillai College of Engineering also has highly qualified faculty members who bring incredible amounts of knowledge in the classroom. The faculty’s experience not only enhances the educational experience but also fosters a culture of innovation and research.\nThe faculty members are professionals with advanced degrees and extensive knowledge on the various fields of engineering and technology. The faculty of the Department of Information Technology are experts in numerous fields and are involved in the following research areas:\nComputer Networks\nDatabases\nBig Data Analytics\nCyber Security\nNatural Language Processing\nGeographic Information Systems\nThe department is equipped with state of the art infrastructure with a highly dedicated faculty. Students at Pillai College of Engineering have ample opportunities to engage in cutting edge research projects across diverse disciplines. Under National Institute of Information Technology Navi Mumbai, Pillai College of Engineering is one of the leading institutes.\nFrequently Asked Questions\nWhat career options are available in Information Technology?\nCareer options include cloud engineer, IT consultant, cybersecurity specialist, software developer, network administrator and more.\nWhat skills will I gain from the IT Engineering course?\nSkills that will be gained in an IT Engineering course are project management, system analysis, database management, network security, software development and many more.\nWhat are the best programs offered for Information Technology at Pillai College of Engineering?\nPillai College of Engineering offers a Bachelor’s of Information Technology and offers courses in data science, cybersecurity and software engineering.\nWhat are the eligibility criteria for Information Technology at Pillai College of Engineering?\nCleared HSC and passed JEE Main or MH-CET.\nWhat is the scope of Information Technology?\nInformation Technology offers a dynamic and promising landscape for career growth and technological advancement.\nWhat are the key deadlines for the application process?\nFor detailed information about application deadlines and the admission process for the Automobile Engineering program at Pillai College of Engineering, please visit the admission page.\nWhat entrance exams are required for admission to Electrical and Computer Engineering?\nThere are two entrance exams that are accepted including the Joint Entrance Examination(JEE) or the Maharashtra Health and Technical Common Entrance Test(MHT CET). A credible score in either of these exams is accepted.\nWhat internship opportunities are available for students?\nStudents can gain practical experience through summer internships at leading tech companies, research institutions, and startups in areas like software development, hardware design, embedded systems, and IoT. The college’s dedicated Training and Placement Cell assists students in securing internships aligned with their interests and career goals.\nDoes Pillai College of Engineering offer job placement services?\nYes. Pillai College is affiliated with various reputed and recognized companies including L&T Infotech, GEP, Capgemini, Tata Consultancy Service, Ekeeda and Dyson.\nFaculty\nInformation Technology Faculty\nDr. Satishkumar L. V\nvsat2k@mes.ac.in\nDr. Prashant S. L\nprashant@mes.ac.in\nDr. Mahendra K\nmkhandkar@mes.ac.in\nSmita G. Joshi\nsjoshi@mes.ac.in\nDeepa B. Ekhande\ndeepaekhande@mes.ac.in\nDr. Shreedevi K\nshreedevikulkarni@mes.ac.in\nY. I. Jinesh Melvin\nyijmelvin@mes.ac.in\nNinad V. Gaikwad\nninad@mes.ac.in\nAlamuri Vasavi\nalamuri.vasavi@mes.ac.in\nChristopher U\nchristopher@mes.ac.in\nVrushali Bahurupi\nvrushalibahurupi@mes.ac.in\nDiksha Kale\ndikshakale@mes.ac.in\nPrerana Kulkarni\npreranakulkarni@mes.ac.in\nAnup M. Vanage\navanage@mes.ac.in\nSupriya A. Waghmare\nsupriyawaghmare@mes.ac.in\nRohit R. Sharma\nrohitsharma@mes.ac.in\nFlorence Simon\nflorence@mes.ac.in\nArpita Agarwal\narpitaagarwal@mes.ac.in\nAditi Bhateja\naditibhateja@mes.ac.in\nRadhika Fulzele\nradhikafulzele@mes.ac.in\nFaculty\nFaculty\nDr. Satishkumar L. V\nvsat2k@mes.ac.in\nDr. Prashant S. L\nprashant@mes.ac.in\nDr. Avinash R. Vaidya\navinashvaidya@mes.ac.in\nDr. Tusharika S. B.\ntbanerjee@mes.ac.in\nSmita G. Joshi\nsjoshi@mes.ac.in\nDr. Mahendra K\nmkhandkar@mes.ac.in\nDr. Shreedevi K\nshreedevikulkarni@mes.ac.in\nDeepa B. Ekhande\ndeepaekhande@mes.ac.in\nY. I. Jinesh Melvin\nyijmelvin@mes.ac.in\nNinad V. Gaikwad\nninad@mes.ac.in\nChristopher U\nchristopher@mes.ac.in\nAlamuri Vasavi\nalamuri.vasavi@mes.ac.in\nDiksha Kale\ndikshakale@mes.ac.in\nVrushali Bahurupi\nvrushalibahurupi@mes.ac.in\nPrerana Kulkarni\npreranakulkarni@mes.ac.in\nAnup M. Vanage\navanage@mes.ac.in\nRohit R. Sharma\nrohitsharma@mes.ac.in\nSupriya A. Waghmare\nsupriyawaghmare@mes.ac.in\nArpita Agarwal\narpitaagarwal@mes.ac.in\nFlorence Simon\nflorence@mes.ac.in\nAditi Bhateja\naditibhateja@mes.ac.in\nRadhika Fulzele\nradhikafulzele@mes.ac.in\nApply For Admission\nPCE\n©\nMES\n| Designed by\nVidyadhan Educational Development Private Limited\nCampuses:\nPANVEL |\nNEW PANVEL\n|\nKHANDA\n|\nRASAYANI\n|\nGORAI\n|\nCHEMBUR\nPillai Group of Institutions\nOnline\nWelcome to Pillai Group of Institutions!\nClick on Start Chat and Just say Hi!\nStart Chat\nChat with us\nStart Your Engineering Journey at PCE\nFill the Admission Enquiry Form\nName\n*\nPhone Number\n*\nEmail\n*\nCET Score\nField of Interest\n*\nSelect a Course\nAutomobile Engineering\nComputer Engineering\nElectronics and Computer Science\nElectronics and Telecommunication\nInformation Technology\nMechanical Engineering\nSubmit",
  "tables": [
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Automobile Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Computer Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Computer Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Computer Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Electronics & Computer Science",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Electronics Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Electronics Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "EXTC Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Information Technology",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Information Technology",
        "Masters Degree",
        "2 years"
      ],
      [
        "Information Technology",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Mechanical Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Mechanical Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Mechanical Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "ASM",
        "Bachelor Degree",
        "1 year"
      ]
    ],
    [
      [
        "Affiliated to",
        "Duration",
        "Academic Year",
        "Intake",
        "Theory Exam",
        "Curriculum"
      ],
      [
        "University of Mumbai",
        "4 years, Full Time",
        "2 semesters each",
        "120",
        "University of Mumbai",
        "Sem I - VIII"
      ]
    ],
    [
      [
        "Sr. No.",
        "Documents"
      ],
      [
        "1",
        "ARC (CAP) Allotment Letter (FC Registration Form in case of Institute Level and Against CAP Admission)"
      ],
      [
        "2",
        "S.S.C. Marksheet and Passing Certificate"
      ],
      [
        "3",
        "H.S.C. Marksheet and Passing Certificate"
      ],
      [
        "4",
        "Leaving / Transfer Certificate"
      ],
      [
        "5",
        "Caste Certificate (if applicable)"
      ],
      [
        "6",
        "Caste Validity Certificate (if applicable)"
      ],
      [
        "7",
        "Non-creamy Layer Certificate (only for DT/VJ, NT, OBC, SBC)"
      ],
      [
        "8",
        "Migration Certificate (if applicable)"
      ],
      [
        "9",
        "Domicile Certificate"
      ],
      [
        "10",
        "Equivalence Certificate (if applicable)"
      ],
      [
        "11",
        "Photocopy of Aadhar Card"
      ],
      [
        "12",
        "Gap Certificate (if applicable)"
      ],
      [
        "13",
        "Income Certificate (if applicable)"
      ],
      [
        "14",
        "Duly signed printout of Anti-Ragging Affidavit submitted online on www.antiragging.in by Candidate and Parent"
      ],
      [
        "15",
        "Printout of duly signed University of Mumbai Pre-Admission Online Registration Form (mum.digitaluniversity.ac) with one set of all the above mentioned Documents (University's Institute Code: 561)"
      ],
      [
        "16",
        "MHT CET/JEE Score Card"
      ]
    ],
    [
      [
        "YEAR",
        "GENERAL",
        "OBC",
        "SC/ST",
        "SBC/DT/VJ/NT",
        "TFWS",
        "J&K"
      ],
      [
        "FIRST YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,37,360/-",
        "79,534/-",
        "4,360/-",
        "21,708/-",
        "21,708/-",
        ""
      ]
    ],
    [
      [
        "YEAR",
        "GENERAL",
        "OBC",
        "SC/ST",
        "SBC/DT/VJ/NT",
        "TFWS",
        "J&K"
      ],
      [
        "FIRST YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,38,360/-",
        "80,534/-",
        "5,360/-",
        "22,708/-",
        "22,708/-",
        "29,360/-"
      ],
      [
        "DIRECT SECOND YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,38,360/-",
        "80,534/",
        "5,360/-",
        "22,708/-",
        "--",
        "--"
      ]
    ]
  ],
  "character_count": 29825
}