{
  "page_name": "Leadership",
  "url": "https://www.pce.ac.in/about/leadership/",
  "scraped_at": "2025-10-30T17:13:47.771999",
  "text_content": "Leadership\nDr. K. M. Vasudevan Pillai\nChairman & CEO\n“We are committed to provide a holistic education based on new generation academics that creates powerful global career options to our students and at the same time make them key contributors to the society at large. We strive to achieve nation building by emphasizing on character building of individual. This is done through approach of mentoring.”\nmore…\nDr. Daphne Pillai\nSecretary\n“In this fiercely competitive world, success has several dimensions far widespread than the vortex of academia, spreading its tentacles into diverse fields which one has to adapt to. Our objective at Pillai is to provide you the right environment which will enable you to fulfill all aspirations and ambitions. Very often one is not even aware of one’s own capabilities and we at Pillai’s believe that even if we succeed in making the student scratch the tip of iceberg, we have set the ball rolling for individuals to achieve ultimate success in life.”\nmore…\nDr. Sandeep Joshi\nPrincipal, PCE\nDr. Joshi holds a Doctorate degree in Mechanical Engineering from IIT Bombay and has over 23 years of professional experience.\nHis research areas include Heat Transfer, Sustainable renewable energy, Low cost solar energy utilization, Waste heat recovery and Energy management. He has two Indian Patents on Solar Air Heater and Solar Agro produce Dryer. He also has 14 papers in International Journals of well repute and 18 papers in peer reviewed international conferences. (contd…)\nPrincipal Dr. Joshi has delivered many Seminars / Invited Lectures / Talks for Students as well as teachers on various topics like Solar Energy Utilization, Basics of Heat Transfer, Excellence in Teaching, Project Based Learning, Experimental Approach in Mechanical Engineering, Good Report Writing, IPR and Patenting, Outcome Based Learning, Use of ICT in Teaching and learning, etc.\nHe is Member, Board of Studies in Mechanical Engineering, University of Mumbai, since October 2015. He was Special Invitee by Board of Studies Mechanical Engineering, University of Mumbai for framing the scheme and structure of UG Credit Based Semester Grading System, CBSGS, Syllabus 2012. He was Core Member of Syllabus Committee for setting up CBSGS (Credit Based Semester Grading System) 2012 and CBCGS (Choice Based Credit and Grading System) 2016 syllabus of BE Mechanical Engineering, Automobile Engineering, M.E. with Thermal Engineering, Heat Power Engineering and Energy Systems and Management.\nFrom The Principal’s Desk\nDear Students,\nWelcome to Pillai’s Group of Institutions. I am delighted that you have chosen Engineering as your profession and pleased even further that Pillai College of Engineering is your chosen pathway to the career of your dreams.\nThe career opportunities for engineering graduates in this era of globalisation are immense. It is imperative that students are fully prepared to take advantage of these opportunities. The four years that you will spend on this course will develop all the skills that you will need in your professional life. PCE will make every effort to create the perfect environment for you to hone required professional skills. One’s personal initiative will become vital in order to make full advantage of the extracurricular activities and social opportunities available at PCE.\nWith the number of educational institutions growing increasingly, India is poised to take full advantage of the globalisation process. Pillai College of Engineering is equipped to meet the growing national demand of knowledge professionals offering both Bachelors and Masters level study programs in various disciplines to cater to the requirements of modern industry.\nI assure you that your engagement with Pillai College of Engineering in the coming years will be enriching experience for you. These years of higher education will prove vital to your professional growth as co-curricular activities help you to become a well-rounded personality. Our goal is to continue to prepare a future generation of engineers who are innovative leaders and creative problem solvers. PCE is committed to the utmost satisfaction of students, their parents and potential employers.\nI am confident that with the contemporary education and strong moral values at PCE, you will march ahead triumphantly to capture all glory and success in your professional, social as well personal life. I wish you all the best for your career. Thank you for entrusting us to shape your career.\nPCE\n©\nMES\n| Designed by\nVidyadhan Educational Development Private Limited\nCampuses:\nPANVEL |\nNEW PANVEL\n|\nKHANDA\n|\nRASAYANI\n|\nGORAI\n|\nCHEMBUR\nPillai Group of Institutions\nOnline\nWelcome to Pillai Group of Institutions!\nClick on Start Chat and Just say Hi!\nStart Chat\nChat with us",
  "tables": [],
  "character_count": 4779
}