{
  "page_name": "Mechanical Engineering",
  "url": "https://www.pce.ac.in/academics/bachelors/mechanical-engineering/",
  "scraped_at": "2025-10-30T17:12:27.191263",
  "text_content": "Departments\nAutomobile Engineering\nProgram\nLevel\nDuration\nAutomobile Engineering\nBachelor Degree\n4 years\nComputer Engineering\nProgram\nLevel\nDuration\nComputer Engineering\nBachelor Degree\n4 years\nComputer Engineering\nMasters Degree\n2 years\nComputer Engineering\nPh.D. Program\n3 years\nElectronics & Computer Science\nProgram\nLevel\nDuration\nElectronics & Computer Science\nBachelor Degree\n4 years\nElectronics Engineering\nMasters Degree\n2 years\nElectronics Engineering\nPh.D. Program\n3 years\nElectronics & Telecommunication\nProgram\nLevel\nDuration\nEXTC Engineering\nBachelor Degree\n4 years\nInformation Technology\nProgram\nLevel\nDuration\nInformation Technology\nBachelor Degree\n4 years\nInformation Technology\nMasters Degree\n2 years\nInformation Technology\nPh.D. Program\n3 years\nMechanical Engineering\nProgram\nLevel\nDuration\nMechanical Engineering\nBachelor Degree\n4 years\nMechanical Engineering\nMasters Degree\n2 years\nMechanical Engineering\nPh.D. Program\n3 years\nApplied Science and Mathematics\nProgram\nLevel\nDuration\nASM\nBachelor Degree\n1 year\nAdmissions\nDSE Notice – Vacant seats and Merit List\nNotice 8/9/25- IL/Vacant seats and Merit List\nF.E. Documents List 2025-26\nScholarship Details\nB.Tech. DSE Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nB.Tech. F.E. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM.Tech. Fees Structure 2025-26\nEnglish | Marathi | Malayalam\nM. Tech. IL & ACAP Admission\nImportant Admission Notice\nApply Online (FE only)\nOnline Portal\nPCE MOCK CET Online Portal\nPCE Online Student Portal\nPCE ASK (Attitude Skills and Knowledge) Portal\nPCE Online Library Portal\nConnect with us\nFacebook\nTwitter\nYouTube\nInstagram\nLinkedIn\nStudent Associations\nMechanical Engineering\nIntroduction\nProgram Overview\nAdmission Process\nExams\nTraining and Development\nCareer Prospects\nWhy Choose Pillai College\nFAQs\nAbout Mechanical Engineering\nFees Structure\nFaculty\nLab\nIntroduction\nOverview :\nMechanical Engineering at Pillai College of Engineering (PCE) stands as a cornerstone of engineering excellence in Navi Mumbai. The department, established with a vision to nurture innovative engineers, offers a comprehensive four-year B.Tech program that combines theoretical knowledge with practical applications. As one of the best mechanical engineering colleges in Navi Mumbai, PCE’s program is designed to meet the evolving demands of the industry while maintaining academic rigor, innovation, and a commitment to developing future-ready engineers.\nProgram Outcomes:\nPO1: Engineering Knowledge: Apply knowledge of mathematics, natural science, computing, engineering fundamentals and an engineering specialization as specified in WK1 to WK4 respectively to develop to the solution of complex engineering problems.\nPO2: Problem Analysis: Identify, formulate, review research literature and analyze complex engineering problems reaching substantiated conclusions with consideration for sustainable development. (WK1 to WK4)\nPO3: Design/Development of Solutions: Design creative solutions for complex engineering problems and design/develop systems/components/processes to meet identified needs with consideration for the public health and safety, whole-life cost,net zero carbon, culture, society and environment as required. (WK5)\nPO4: Conduct Investigations of Complex Problems: Conduct investigations of complex engineering problems using research-based knowledge including design of experiments, modelling, analysis & interpretation of data to provide valid conclusions. (WK8).\nPO5: Engineering Tool Usage: Create, select and apply appropriate techniques, resources and modern engineering & IT tools, including prediction and modelling recognizing their limitations to solve complex engineering problems. (WK2 and WK6)\nPO6: The Engineer and The World: Analyze and evaluate societal and environmental aspects while solving complex engineering problems for its impact on sustainability with reference to economy, health, safety, legal framework, culture and environment. (WK1, WK5, and WK7).\nPO7: Ethics: Apply ethical principles and commit to professional ethics, human values, diversity and inclusion; adhere to national & international laws. (WK9).\nPO8: Individual and Collaborative Team work: Function effectively as an individual, and as a member or leader in diverse/multi-disciplinary teams.\nPO9: Communication: Communicate effectively and inclusively within the engineering community and society at large, such as being able to comprehend and write effective reports and design documentation, make effective presentations considering cultural, language, and learning differences\nPO10: Project Management and Finance: Apply knowledge and understanding of engineering management principles and economic decision-making and apply these to one’s own work, as a member and leader in a team, and to manage projects and in multidisciplinary environments.\nPO11: Life-Long Learning: Recognize the need for, and have the preparation and ability for\nindependent and life-long learning\nadaptability to new and emerging technologies and\ncritical thinking in the broadest context of technological change. (WK8)\nProgram Educational Objectives:\nTo prepare students for successful careers in industry to meet the needs of Indian and Global companies.\nTo develop the ability among students to synthesize data, interpret them appropriately and be able to apply concepts to mechanical system design or to a mechanical subsystem of an interdisciplinary system.\nTo provide opportunity for students to work in their individual capacity as well as to function as teams on multidisciplinary projects.\nTo enable students for lifelong learning and introduce them to professional ethics and sustainable development.\nTo develop among students an attitude towards self-employment through entrepreneurship.\nProgram Specific Outcomes:\nStudents should be able to generate and develop ideas that can result in self- employment (eg.Start-ups) and also result in creation of more jobs for the society.\nStudents should be able to model and develop solutions for problems relevant to industry and the society at large.\nMechanical Engineering\nDefinition and Scope:\nMechanical Engineering encompasses the design, manufacturing, and maintenance of mechanical systems. At PCE, the program covers core areas including:\nDesign Engineering\nThermodynamics\nManufacturing Processes\nIndustrial Automation\nProject Management\nIndustry 4.0 Technologies\nVision:\nTo develop a world class program with excellence in teaching, learning and research that would lead to growth, innovation and recognition.\nMission:\nThe mission of the Mechanical Engineering Program is to benefit the society at large by providing technical education to interested and capable students. These technocrats should be able to apply basic and contemporary science, engineering and research skills to identify problems in the industry and academia and be able to develop practical solutions to them.\nPrograms Offered at Pillai College of Engineering\nBachelor of Mechanical Engineering Course Structure\nThe curriculum is structured to provide a balance between foundational knowledge and emerging technology, including:\nCore subjects: Thermodynamics, Design Engineering, Manufacturing Processes\nAdvanced courses: Industry 4.0, Robotics, and Automation\nPractical training through laboratory work\nIndustry internships\nFinal year projects\nAffiliated to\nDuration\nAcademic Year\nIntake\nTheory Exam\nCurriculum\nUniversity of Mumbai\n4 years, Full Time\n2 semesters each\n60\nUniversity of Mumbai\nSem I - VIII\nUnique Features of the Program\nPillai College of Engineering is one of the top colleges in Navi Mumbai for Mechanical Engineering due to the niche areas of excellence provided by the college that has been carefully curated for Mechanical Engineering students.\nDepartment Level Specialization:\nThermal Engineering and Energy Science\nDesign Engineering\nMechatronics & Robotics\nMaterials Science and Nanotechnology\nManufacturing Engineering\nAutomotive System\nInstitute Level Specialization:\nEntrepreneurship Development and Management\nBusiness Management\nIP Management\nBioengineering\nBio Instrumentation\nEngineering Design\nSustainable Technologies\nContemporary Studies\nArt and Journalism\nApplied Science\nGreen Technologies\nMaintenance Engineering\nLife Skills\nEnvironment & Safety\nResearch Areas:\nRenewable Energy\nRefrigeration and Air Conditioning\nAdvanced Heat Transfer\nComputer Aided Manufacturing\nMechatronics & Robotics\nAdvanced Manufacturing\nComputational Fluid Dynamics\nAdmission Process\nAdmission Requirements\nTo apply for the Bachelor of Mechanical Engineering at Pillai College of Engineering, students must meet specific academic qualifications and submit the required documentation.\nEducational Qualifications:\nCandidates must have passed the HSC (Higher Secondary Certificate) examination or an equivalent qualification.\nPhysics and Mathematics are compulsory subjects.\nIn addition to Physics and Mathematics, candidates must have one of the following subjects:\nChemistry\nBiotechnology\nBiology\nTechnical Vocational subjects\nMinimum Marks Requirement:\nCandidates must have obtained at least 45% marks in the qualifying examination.\nFor students from backward class categories, Economically Weaker Sections, and Persons with Disability from Maharashtra, the minimum requirement is 40% marks.\nEntrance Examination:\nApplicants must have appeared for either the MHT-CET (Maharashtra Common Entrance Test) or JEE Main.\nA non-zero score in one of these examinations is mandatory.\nDiploma Holders:\nCandidates with a Diploma in Engineering and Technology are also eligible for admission.\nThey must have secured at least 45% marks (40% for certain backward class categories) in their diploma program.\nNote:\nThe cutoff for Mechanical Engineering 2024-25 at Pillai College was 61.635 percentile.\nDocuments Required:\nThe documents necessary to complete the admission process include the following:\nSr. No.\nDocuments\n1\nARC (CAP) Allotment Letter or FC Registration Form (for Institute\n2\nLevel/Against CAP Admissions)\n3\nSSC and HSC Marksheet & Passing Certificates\n4\nLeaving/Transfer Certificate\n5\nMHT-CET/JEE Score Card\n6\nCaste Certificate and Validity (if applicable)\n7\nNon-creamy Layer Certificate (if applicable)\nMigration and Domicile Certificate (if applicable)\n8\nAadhaar Card photocopy\n9\nIncome Certificate and Gap Certificate (if applicable)\n10\nAnti-Ragging Affidavit (submitted online)\n11\nUniversity of Mumbai Pre-Admission Registration Form printout\nStudents applying to top mechanical engineering colleges in Mumbai, like Pillai College of Engineering, must ensure they have all necessary qualifications and documents ready for submission.\nApply Online\nFee Structure:\nFee Structure For Maharashtra State Board Students\nYEAR\nGENERAL\nOBC\nSC/ST\nSBC/DT/VJ/NT\nTFWS\nJ&K\nFIRST YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,37,360/-\n79,534/-\n4,360/-\n21,708/-\n21,708/-\nFee Structure For Other Than Maharashtra State Board Students\nYEAR\nGENERAL\nOBC\nSC/ST\nSBC/DT/VJ/NT\nTFWS\nJ&K\nFIRST YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,38,360/-\n80,534/-\n5,360/-\n22,708/-\n22,708/-\n29,360/-\nDIRECT SECOND YEAR ENGINEERING\nTOTAL FEES (Rs.)\n1,38,360/-\n80,534/\n5,360/-\n22,708/-\n--\n--\nExam Preparation Resources:\nMechanical Engineering Syllabus in IIT Bombay:\nApplication Timeline\nThe admission process for Mechanical Engineering at Pillai College of Engineering typically follows the MHT-CET and JEE Main merit system.\nHere are the general key application milestones:\nKey Application Milestones:\nMHT-CET Registration: Generally opens in early January.\nMHT-CET Exam Date: Usually held in May.\nCAP Rounds: Commence after the exam results, typically in June-July.\nAdmission Deadlines: Vary based on the schedules for CAP rounds and JEE Main results.\nImportant Notes:\nIt is essential for prospective students to stay updated on application openings, CAP round deadlines, and document verification periods each year.\nMeeting the eligibility criteria will help ensure a smooth admission process.\nTo stay informed about specific dates, students should regularly check the official MHT-CET website.\nBy keeping track of these important dates and requirements, students can effectively navigate their journey to admission at Pillai College of Engineering.\nMechanical Engineering Exams\nOverview of Relevant Exams\nTo pursue a Bachelor of Mechanical Engineering at Pillai College of Engineering, students must qualify through competitive entrance exams.\nThe primary exam for admission is the MHT-CET (Maharashtra Common Entrance Test), conducted by the State Common Entrance Test Cell, Maharashtra. This exam evaluates candidates on essential subjects such as Physics, Mathematics, and Chemistry/Biology, with a non-zero score required for eligibility.\nAlternatively, students can also apply through the JEE Main exam, a national-level assessment recognized for admissions to engineering programs across India. Both MHT-CET and JEE Main scores play a significant role in securing admission to top engineering colleges, including Pillai College of Engineering.\nBy excelling in entrance exams like MHT-CET or JEE Main, aspiring engineers can embark on their educational journey at Pillai College of Engineering, setting themselves up for a rewarding future in mechanical engineering.\nExam Preparation Resources\nPreparing for entrance exams like MHT-CET and JEE Main is crucial for aspiring students looking to secure a spot at Pillai College of Engineering, one of the leading colleges for mechanical engineering in Navi Mumbai. Here are some recommended study materials and strategies to help you excel:\nRecommended Study Materials:\nTextbooks: Focus on NCERT textbooks for Physics, Mathematics, and Chemistry, as they cover fundamental concepts that are essential for both MHT-CET and JEE Main.\nReference Books:\nPhysics: “Concepts of Physics” by H.C. Verma\nMathematics: “Objective Mathematics” by R.D. Sharma\nChemistry: “Organic Chemistry” by Morrison and Boyd\nOnline Resources: Websites like Khan Academy, BYJU’S, and Unacademy offer video lectures and practice problems specifically tailored for these entrance exams.\nPrevious Year Papers: Solve previous years’ question papers for MHT-CET and JEE Main to understand the exam pattern and frequently asked questions.\nMock Tests: Regularly take mock tests to build your exam temperament and time management skills. Many coaching centers and online platforms provide simulated exam environments.\nNote: For practicing you can visit:\nmockcet.mes.ac.in\nStudy Strategies:\nCreate a Study Schedule: Allocate specific time blocks for each subject and stick to your schedule. Regular revisions are key to retaining information.\nFocus on Weak Areas: Identify your weak points in each subject and dedicate extra time to improve those areas.\nGroup Study: Collaborate with peers preparing for the same exams to share resources and solve problems together. This can enhance understanding and make studying more engaging.\nStay Updated: Follow announcements related to the exams and admission process to ensure you don’t miss any important information.\nBy utilizing these resources and strategies, students can enhance their chances of success in the entrance exams and secure their place at Pillai College of Engineering. Excelling in these exams is not just about hard work; it’s also about strategic preparation that aligns with the requirements of one of the top colleges for mechanical engineering in Navi Mumbai.\nNote:\nFor practicing you can visit:\nmockcet.mes.ac.in\nTraining and Development Opportunities\nInternships and Industry Collaboration\nPillai College of Engineering (PCE) is one of the top Engineering Colleges in Navi Mumbai for Mechanical Engineering. It is affiliated with various top companies and industries. The students are equipped with extensive conceptual knowledge and reasoning and get access to various companies to gain practical as well as theoretical\nknowledge. We are proud to present the diverse range of internship opportunities facilitated by our college. Our dedicated placement cell works diligently to connect students with leading industry employers.\nSome of these leading companies in collaboration with our college, who provide internships to our students are mentioned below:\nOur Industry Collaboration\nBest Computer Training Institutes in Navi Mumbai Region:\nSkill Enhancement Programs Facilitated by PCE\nIIT Bombay Remote Center: Our College is a Remote center for IIT Bombay with a rating of 4 stars. It helps to keep in touch with the contemporary technical skills of students and teaching skills of faculty colleagues in core Engineering and Science subjects both physically and virtually.\nValue-Added Courses:\nThe institute conducts various value-added courses to enhance the teaching and learning experience, making our college one of the best mechanical institutes in Panvel & Navi Mumbai.\nCertification Programs:\nSolidworks Global Certification Course\n2D Drafting Basics\nGeometric Dimensioning and Tolerance\nValue-Added Course on ANSYS\nMachinery Maintenance\nIndustry 4.0\nStudent Clubs:\nISHRAE PCE:\nISHRAE stands for Indian Society of Heating Ventilation and Air Conditioning Engineers. It is a subchapter which comes under ISHRAE Thane Chapter controlled by ISHRAE West Zone. ISHRAE PCE Conducts Industrial Visits, Seminars, Webinars, K-12, Anubhav, Job Fair, Opportunities in Internship and Job for HVAC Department, etc\nISHRAE-PCE\nRacing Teams:\nHYPERION RACING:\nHyperion Racing is a team of dedicated students who design and manufacture racing cars in order to participate in Formula Student events around the world. The students use the knowledge acquired in the classroom to innovate while staying within the restrictions of the competitions. The team comprises students from all streams of engineering which allows the diverse thoughts and ideas. The team was started back in 2013.\nHYPERION RACING:\nSpark Racing Team is a Formula Student electric type race car team,     based in Navi Mumbai. We are a team of young students who aspire to create a mark in massive competitions like Formula Imperial and Formula Bharat!  The team independently designs, manufactures and tests Automotive vehicles which then compete at National and International level competition.\nVANGUARD RACING:\nThe Vanguard Racing Team is a part of Pillai College of Engineering located in New Panvel, Navi-Mumbai. This team is made up of undergraduate engineering students from many fields that are excited about growing, developing, and planning to increase their knowledge and soft skills. We design, build, and manufacture an All-Terrain Vehicle (ATV) that competes in a variety of competitions.\nCareer Prospects for Graduates\nJob Opportunities After Graduation\nA degree in Mechanical Engineering opens pathways to careers in design, manufacturing, automation, and innovative mechanical systems. Graduates from top colleges in Navi Mumbai gain a competitive edge, unlocking global opportunities in the dynamic and ever-evolving mechanical engineering field.\nCAD/CAM Design Engineer\nDevelop and design mechanical components using CAD/CAM software.\nProject Engineer\nManage mechanical projects ensuring efficient execution and delivery.\nManufacturing Engineer\nOversee manufacturing processes to improve efficiency and quality.\nProduct Development Engineer\nDesign and develop innovative mechanical products and systems.\nQuality Assurance Engineer\nEnsure products meet quality standards and regulatory compliance.\nProcess Engineer\nOptimize mechanical processes for better performance and cost-effectiveness.\nRobotics Engineer\nDesign and develop robotic systems for automation and manufacturing.\nAutomotive Design Engineer\nDesign and innovate automotive systems and components.\nPlant Engineer\nManage plant operations and ensure efficient functioning of machinery.\nR&D Engineer\nConduct research to develop advanced mechanical technologies.\nThermal Engineer\nDesign and analyze systems involving heat transfer and thermodynamics.\nTool Design Engineer\nDesign tools and dies for manufacturing processes.\nAutomation Engineer\nDevelop automation solutions for industrial and mechanical systems.\nEnergy Systems Engineer\nDesign and optimize energy systems for sustainable solutions.\nAfter completing a Bachelor of Mechanical Engineering at our college in Navi Mumbai, our alumni are well-trained and become industry-ready in totality. PCE’s consistent placement record speaks to the employability of its graduates, with leading companies offering competitive packages averaging 5-7 LPA.\nPast Placement Records of Mechanical Graduates at PCE:\nVinit Patil:\n5.5 LPA offer from Reliance Industries Limited\nIndrajith Nair:\n4.5 LPA offer from Asahi India Glass Ltd.\nRahul Kothawadekar:\n5.5 LPA offer from Taj Hotel\nPrathamesh Sawant:\n5.5 LPA offer from Taj Hotel\nInternship Success Stories:\nAverage stipend:\nOffered for an Automobile Engineering graduate at PCE is around 15-20K.\nHighest stipend:\nOffered for a Mechanical Engineering graduate is\n25K\n.\nPast Internship Records:\nManirul Chaudhari, Batch of 2024, got an internship at\nSutantra Machine Pvt Ltd\nwith a stipend of 25K.\nChirag Mhase, Batch of 2024, got an internship at\nTritorc Equipments Pvt Ltd\nwith a stipend of 15K.\nPratham Mohite, Batch of 2024, got an internship at\nToyo Engineering Pvt Ltd\n.\nAnurag Chauhan and Debarun Basu, Batch of 2024, got internships at\nBosch Chassis System Ltd\n.\nVedant Potdar, Batch of 2024, got an internship at\nGodrej and Boyce Manufacturing Company Ltd\n.\n12 students from the Batch of 2024 got internships at\nIIT Bombay\n.\nA total of 112 students from the Batch of 2024 secured internships, with 6 students receiving Pre-Placement Offers (PPOs).\nPlacement Success Stories: Mechanical Engineering at PCE\nAt Pillai College of Engineering (PCE), the Mechanical Engineering department continues to set a benchmark for successful placements. Over the years, students have secured prestigious roles in leading companies with competitive packages.\nAverage and Highest Packages:\nThe average package offered for Mechanical Engineering graduates at PCE ranges from\n3-5 LPA\n, showcasing consistent demand for our talented graduates. The\nhighest package offered\nfor a Mechanical Engineering graduate is an impressive\n6.6 LPA and 11 LPA\n, achieved in both\n2022\nand\n2023\n.\nHighlights of Past Placements:\nBatch of 2022:\nParth Jitendra Sangle:\n5.5 LPA at GEP\nKrunal Deepak Name\nand\nAhmed Arif Thakur:\n6.6 LPA at Jaro\nSakshi Jitendra Chavan\n,\nRohit Rajendra Shinde\n, and\nAdarshram Ramachandran Nair:\n3.36 LPA at TCS Ninja\nBatch of 2023:\nShubham Shinde:\n11 LPA at Abode Real Estate Dubai\nFebin Biju\nand\nAniruddh Achary:\n6.6 LPA at Jaro\nMayur Subil Musale\nand\nKaiwalya Manohar Acharya:\n5.5 LPA at Reliance Industries Limited\nYash Kotawandekar\nand\nGourang Marathe:\n3.6 LPA at Periurja Energy\nJidnesh Dengane:\n3.96 LPA at Periurja Energy\nBatch of 2024:\nVinit Pramod Patil:\n5.5 LPA at Reliance Industries\nSumit Surve:\n4.9 LPA at Econship Tech Pvt Ltd\nIndrajith Nair:\n4.5 LPA at Asahi India Glass Limited\nSahil S Utekar:\n4.75 LPA at Utpnn Greentech\nThe consistent success of Mechanical Engineering graduates at PCE reflects the college’s commitment to academic excellence, industry-relevant training, and fostering employability skills. Our students continue to achieve great heights, making PCE a preferred destination for recruiters across diverse industries.\nOur Top Recruiters Include:\nAlumni Success Stories\nRohit Singh\nProject Management Professional at Maire Tecnimont [ Batch- 2009 ]\nPMP Certified Project Management Professional (Mechanical Engineer) with varied exposure in Project Management, Planning, Control, Budgeting, Costing, Estimation, Engineering, Fabrication and Procurement.\nAnamil Mehta\nEquipment engineer | Semiconductors | Thin Films | Epitaxy | Mechatronics [ Batch- 2015 ]\nM.S in Mechanical engineering with concentration in Mechatronics. Nine plus years of professional experience in process optimization and maintenance of automated manufacturing equipments in the Semi conductor industry\nNikhil Ghule\nAssociate Consultant at Capgemini | RPA | UiPath [ Batch- 2021 ]\nSenior analyst at Capgemini. Experienced in developing, testing and deploying automation workflows using UiPath and other tools.\nChandan Kumar\nOil and Gas Services Driller [ Batch- 2007 ]\nHaving in-hand experience of 17 years in the oil and gas industry in various fields and departments. Having offshore and onshore experience in India Gabon and Nigeria African countries. Worked in ONGC offshore mumbai high: from 2007 to 2010.Sterling oil and gas exploration, Nigeria: from 2010 to 2012 Punj loyd upstream Ltd, Gabon: from 2013 to 2015. British oil and gas exploration Ltd, Nigeria: from 2015 to till date.\nWhy Choose Pillai College of Engineering for Mechanical Engineering\nQuality of Education at PCE\nOur college stands out as one of the best colleges for B.Tech in Mechanical Engineering due to its rigorous accreditation, which ensures that our programs adhere to high educational standards and deliver a comprehensive curriculum. Being approved by top institutional bodies ensures that our programs meet national benchmarks and guarantees a quality learning experience, enhancing our graduates’ employability and credibility in the professional world, thus making our college one of the top colleges in Navi Mumbai.\nAffiliation and Approval:\nAffiliated to the University of Mumbai\nApproved by All India Council for Technical Education (AICTE), New Delhi\nRecognized by the Government of Maharashtra and DTE, Maharashtra\nGranted Autonomous Status by University Grants Commission, New Delhi from the academic year 2022-23\n4 UG courses are Permanently Affiliated with the University of Mumbai\nAccreditation:\nNAAC A+ grade\n3 UG courses were Re-accredited in 2015 and in 2018 by NBA\nState-of-the-Art Facilities:\nInfrastructure and Facilities:\nPCE has state-of-the-art facilities and its distinguished faculty has been nurturing students of high academic capabilities. It is established on 16 acres of lush green campus with 2,30,000 sq. ft. of built-up area.\nSmart classrooms\nAuditorium\nSeminar Halls\nE-learning Studio\nResearch Centers\nLanguage Labs\nPillai Centre of Innovation and Entrepreneurship\nGreen Infrastructure\nE-waste Recycling\nRainwater Harvesting\nSolar power generation\nPlastic Bottle Recycling Machine\nLabs specifically designed for Mechanical Course:\nThermal Engineering Lab (Steam Power Plant)\nCNC Lab\nFluid Mechanics\nRefrigeration and Air conditioning\nHeat and Mass Transfer\nStrength of Materials\nTheory of Machinery\nMachine Shop\nMechatronics Lab\nCAD/FEA Lab\nFrequently Asked Questions\nWhat is the scope of mechanical engineering in India?\nMechanical engineering in India\noffers a vast array of career opportunities across sectors like automotive, aerospace, energy, robotics, manufacturing, and infrastructure. As one of the oldest and most versatile branches, mechanical engineering remains essential in fields where machinery, energy, and design intersect. Graduates find roles in multinational companies, government agencies, and private firms with starting packages averaging around 4-6 LPA.\nWhy choose Pillai College of Engineering (PCE) for mechanical engineering?\nPCE is among the\nbest mechanical engineering colleges in Mumbai\n, with a program that emphasizes hands-on learning, modern facilities, and experienced faculty. The department is NAAC ‘A’ accredited and offers specialized laboratories for CAD/CAM, robotics, thermal engineering, and more, preparing students for high-demand roles in\nmechanical engineers in India\nand abroad. PCE’s strong industry partnerships also enable valuable internship and placement opportunities, with an impressive 85% placement record\nWhat is the eligibility criteria for the mechanical engineering course at PCE?\nTo apply for the\nengineering degree courses in India\nat PCE, prospective students need to have completed their 10+2 education with Physics, Chemistry, and Mathematics (PCM) as core subjects. A valid score in either JEE or MHT-CET is required, with admission based on merit through a transparent process. Specific cutoffs vary annually, and students are encouraged to apply early.\nHow is the mechanical engineering curriculum structured?\nThe\nmechanical engineering course\nat PCE is structured to provide a balance between foundational knowledge and emerging technology. Core subjects include Thermodynamics, Design Engineering, and Manufacturing Processes, alongside advanced courses in Industry 4.0, Robotics, and Automation. Elective courses and a final-year project enable students to specialize in areas of interest.\nWhat industry connections does the mechanical engineering department have?\nPCE has partnerships with several leading industry players, ensuring students have access to real-world applications and internship opportunities. Collaborations with companies such as Tata Motors, L&T, and Mahindra & Mahindra give students hands-on exposure and strengthen their employability.\nWhat research opportunities are available for mechanical engineering students?\nResearch is a key focus at PCE. The\nmechanical engineering department\nconducts industry-sponsored and government-funded research projects in areas like sustainable energy, materials engineering, and automation. Students can participate in these projects and gain practical experience in cutting-edge fields. Research publications and patent opportunities also allow students to build a strong research profile.\nThe Faculty of the Department of Mechanical Engineering are experts in numerous disciplines and are involved in following research areas:\nRenewable Energy\nRefrigeration and Air Conditioning\nAdvanced Heat Transfer\nComputer Aided Manufacturing\nMechatronics & Robotics\nAdvanced Manufacturing\nComputational Fluid Dynamics\nAre there any student clubs or associations for mechanical engineering students?\nYes, PCE hosts the\nMechanical Engineering Students Association (MESA)\n, where students can network, participate in workshops, and collaborate on technical projects. This association organizes events, competitions, and technical talks, fostering a sense of community and encouraging professional development among students.\nWhat is the placement record for mechanical engineering graduates at PCE?\nPCE has an outstanding 85% placement record, with graduates securing positions in top companies such as Tata Motors, Godrej, and L&T. The average starting package for\nmechanical engineers\nis around 5-7 LPA, with opportunities to grow further. The department’s placement cell actively connects students with employers through campus placements and job fairs.\nWhat facilities are available for mechanical engineering students?\nThe\nmechanical engineering department\nat PCE offers a suite of advanced laboratories and workshop facilities, including a CAD/CAM lab, thermal engineering lab, and a robotics and automation lab. The computer simulation center further allows students to experiment with virtual modeling and simulation, ensuring practical learning in line with industry standards.\nDoes the college offer a mechanical engineering diploma?\nCurrently, PCE offers only the full\nB.Tech in Mechanical Engineering\nprogram. Diploma holders looking to advance their education in mechanical engineering may apply for lateral entry, allowing them to enter the B.Tech program directly.\nWhat are the career prospects for mechanical engineering graduates?\nMechanical engineering graduates from PCE are prepared for a range of career paths. Roles in design, quality control, and project management are common in sectors like automotive, aerospace, energy, and manufacturing. Graduates also find positions in automation and robotics, reflecting the growing importance of\nIndustry 4.0 technologies\nin engineering.\nHow can students apply for the mechanical engineering course?\nStudents interested in the\nmechanical engineering course\nat PCE can apply online through the college’s official website. The application process includes completing the online form, submitting required documents, and participating in counseling rounds based on merit scores in JEE/MHT-CET.\nWhat extracurricular activities are available to mechanical engineering students?\nPCE encourages students to engage in various extracurricular activities to develop both technical and soft skills. The Mechanical Engineering Students Association (MESA) organizes workshops, industry visits, and national-level competitions, while guest lectures from industry experts provide additional learning opportunities.\nDoes PCE offer internships for mechanical engineering students?\nYes, PCE mandates internships as part of the\nmechanical engineering course\n, with opportunities facilitated through the department’s strong industry connections. Internships allow students to work directly with companies, gaining hands-on experience and a practical understanding of engineering principles.\nWhat scholarships are available for mechanical engineering students?\nPCE offers a range of scholarships to support students in their pursuit of an\nengineering degree\n. Scholarships are awarded based on merit, financial need, and academic performance, helping students cover tuition costs and other expenses.\nDoes PCE provide international exposure for mechanical engineering students?\nPCE has established collaborations with international academic institutions and professional organizations, providing students with opportunities to participate in exchange programs, internships abroad, and collaborative research. Such exposure gives students a global perspective and makes them more competitive in the international job market.\nWhat support services are available to mechanical engineering students?\nPCE provides several support services to ensure student success, including academic counseling, a dedicated placement cell, and a mentorship program. The library, with its extensive collection of engineering books and journals, and online resources, further aids students in their academic pursuits.\nCan students specialize within the mechanical engineering program?\nWhile PCE offers a general\nB.Tech in Mechanical Engineering\n, students can choose elective courses and focus on areas like robotics, thermal engineering, and Industry 4.0. Additionally, the final-year project allows students to delve deeper into a specific area of interest, which helps with specialization.\nWhat opportunities are there for mechanical engineering graduates to pursue higher studies?\nGraduates from PCE are well-prepared for higher studies in mechanical engineering and related fields. Many alumni choose to pursue M.Tech, MBA, or Ph.D. programs, both in India and internationally, further expanding their career prospects and potential for leadership roles.\nDoes PCE offer career counseling and placement support for mechanical engineering students?\nYes, PCE has a dedicated placement cell that works closely with the\nmechanical engineering department\nto support students in securing jobs post-graduation. Career counseling sessions help students identify their strengths and interests, and placement drives connect students with recruiters from top companies.\nWhat are the key learning outcomes of the Mechanical Engineering program at PCE?\nGraduates of the program will:\nGain strong foundations in\nengineering principles\nsuch as mechanics, thermodynamics, and materials science.\nDevelop skills in\ndesigning, analyzing, and manufacturing mechanical systems\n.\nBe proficient in\nmodern tools and technologies\nlike CAD, IoT, and Data Science.\nAcquire problem-solving and research abilities through\nminor and capstone projects\n.\nUnderstand professional ethics, sustainability, and social responsibilities.\nWhat are the Program-Specific Outcomes (PSOs)?\nPSOs highlight the unique competencies developed in graduates:\nMechanical Systems\n: Design and develop mechanical systems using interdisciplinary skills.\nEntrepreneurial Skills\n: Innovate and create startups to contribute to society.\nTeam Leadership\n: Lead and work effectively in diverse projects.\nIndustry-Relevant Solutions\n: Model and solve industry-specific challenges.\nWhat are the Program Outcomes (POs)?\nThe POs describe the skills and abilities students will acquire:\nEngineering Knowledge\n: Apply foundational knowledge to solve complex engineering problems.\nProblem Analysis\n: Critically analyze and draw substantiated conclusions.\nDesign Solutions\n: Create solutions that prioritize societal and environmental considerations.\nResearch and Tools\n: Conduct investigations using modern tools and research methods.\nSocietal Impact\n: Understand the role of engineering in societal and environmental contexts.\nEthics and Communication\n: Adhere to professional ethics and communicate effectively.\nProject Management\n: Manage projects using engineering and management principles.\nLifelong Learning\n: Stay adaptable in response to technological changes.\nThe\nMechanical Engineering\ndepartment at PCE stands as a testament to excellence in engineering education. With modern facilities, dedicated faculty, robust industry connections, and a successful placement record, PCE is a top choice for aspiring mechanical engineers. Its comprehensive curriculum, practical training, and research opportunities ensure that graduates are well-prepared for careers in India’s and the world’s engineering landscapes.\nApply For Admission\nFaculty\nMechanical Engineering Faculty\nDr. Sandeep M. Joshi\nsmjoshi@mes.ac.in\nDr. Divya P\ndivyamvp@mes.ac.in\nDr. Richa S. Agrawal\nragrawal@mes.ac.in\nDr. Rashed Ali\nrashedali@mes.ac.in\nDr. Gajanan N. Thokal\ngthokal@mes.ac.in\nMiriyala Durga N.K.P.\nmdurgarao@mes.ac.in\nBinsu Babu\nbinsubabu@mes.ac.in\nVaishali S. Kumbhar\nvkumbhar@mes.ac.in\nLalit M. Mehta\nlmehta@mes.ac.in\nShilpa M. Mondkar\nsmondkar@mes.ac.in\nBhagwan S. More\nbsmore@mes.ac.in\nMohd. Shahid I. S\nsmohammed@mes.ac.in\nVinayak P. S\nsuryawanshivinayak@mes.ac.in\nMeeta S. Vedpathak\nmvedpathak@mes.ac.in\nTikaram G. Verma\nvtganpat@mes.ac.in\nNitinkumar More\nnitinkumarmore@mes.ac.in\nPruthviraj P. Rahane\nprahane@mes.ac.in\nDebasish Panda\ndebasishpanda@mes.ac.in\nPranita Thakur\npranitathakur@mes.ac.in\nM. Shivapradeep\nsmuthupandi@mes.ac.in\nPCE\n©\nMES\n| Designed by\nVidyadhan Educational Development Private Limited\nCampuses:\nPANVEL |\nNEW PANVEL\n|\nKHANDA\n|\nRASAYANI\n|\nGORAI\n|\nCHEMBUR\nPillai Group of Institutions\nOnline\nWelcome to Pillai Group of Institutions!\nClick on Start Chat and Just say Hi!\nStart Chat\nChat with us\nStart Your Engineering Journey at PCE\nFill the Admission Enquiry Form\nName\n*\nPhone Number\n*\nEmail\n*\nCET Score\nField of Interest\n*\nSelect a Course\nAutomobile Engineering\nComputer Engineering\nElectronics and Computer Science\nElectronics and Telecommunication\nInformation Technology\nMechanical Engineering\nSubmit",
  "tables": [
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Automobile Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Computer Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Computer Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Computer Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Electronics & Computer Science",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Electronics Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Electronics Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "EXTC Engineering",
        "Bachelor Degree",
        "4 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Information Technology",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Information Technology",
        "Masters Degree",
        "2 years"
      ],
      [
        "Information Technology",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "Mechanical Engineering",
        "Bachelor Degree",
        "4 years"
      ],
      [
        "Mechanical Engineering",
        "Masters Degree",
        "2 years"
      ],
      [
        "Mechanical Engineering",
        "Ph.D. Program",
        "3 years"
      ]
    ],
    [
      [
        "Program",
        "Level",
        "Duration"
      ],
      [
        "ASM",
        "Bachelor Degree",
        "1 year"
      ]
    ],
    [
      [
        "Affiliated to",
        "Duration",
        "Academic Year",
        "Intake",
        "Theory Exam",
        "Curriculum"
      ],
      [
        "University of Mumbai",
        "4 years, Full Time",
        "2 semesters each",
        "60",
        "University of Mumbai",
        "Sem I - VIII"
      ]
    ],
    [
      [
        "Sr. No.",
        "Documents"
      ],
      [
        "1",
        "ARC (CAP) Allotment Letter or FC Registration Form (for Institute"
      ],
      [
        "2",
        "Level/Against CAP Admissions)"
      ],
      [
        "3",
        "SSC and HSC Marksheet & Passing Certificates"
      ],
      [
        "4",
        "Leaving/Transfer Certificate"
      ],
      [
        "5",
        "MHT-CET/JEE Score Card"
      ],
      [
        "6",
        "Caste Certificate and Validity (if applicable)"
      ],
      [
        "7",
        "Non-creamy Layer Certificate (if applicable)"
      ],
      [
        "",
        "Migration and Domicile Certificate (if applicable)"
      ],
      [
        "8",
        "Aadhaar Card photocopy"
      ],
      [
        "9",
        "Income Certificate and Gap Certificate (if applicable)"
      ],
      [
        "10",
        "Anti-Ragging Affidavit (submitted online)"
      ],
      [
        "11",
        "University of Mumbai Pre-Admission Registration Form printout"
      ]
    ],
    [
      [
        "YEAR",
        "GENERAL",
        "OBC",
        "SC/ST",
        "SBC/DT/VJ/NT",
        "TFWS",
        "J&K"
      ],
      [
        "FIRST YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,37,360/-",
        "79,534/-",
        "4,360/-",
        "21,708/-",
        "21,708/-",
        ""
      ]
    ],
    [
      [
        "YEAR",
        "GENERAL",
        "OBC",
        "SC/ST",
        "SBC/DT/VJ/NT",
        "TFWS",
        "J&K"
      ],
      [
        "FIRST YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,38,360/-",
        "80,534/-",
        "5,360/-",
        "22,708/-",
        "22,708/-",
        "29,360/-"
      ],
      [
        "DIRECT SECOND YEAR ENGINEERINGTOTAL FEES (Rs.)",
        "1,38,360/-",
        "80,534/",
        "5,360/-",
        "22,708/-",
        "--",
        "--"
      ]
    ]
  ],
  "character_count": 38713
}